MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_spi.h
  * @brief   Header file of SPI LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_SPI_H
#define STM32C5XX_LL_SPI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(SPI1) || defined(SPI2) || defined(SPI3)

/** @defgroup SPI_LL SPI
  * @{
  */

/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/
/** @defgroup SPI_LL_Private_Macros SPI Private Macros
  * @{
  */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup SPI_LL_Exported_Constants LL SPI Constants
  * @{
  */

/** @defgroup SPI_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_SPI_ReadReg function.
  * @{
  */
#define LL_SPI_FLAG_RXP                            (SPI_SR_RXP)
#define LL_SPI_FLAG_TXP                            (SPI_SR_TXP)
#define LL_SPI_FLAG_DXP                            (SPI_SR_DXP)
#define LL_SPI_FLAG_EOT                            (SPI_SR_EOT)
#define LL_SPI_FLAG_TXTF                           (SPI_SR_TXTF)
#define LL_SPI_FLAG_UDR                            (SPI_SR_UDR)
#define LL_SPI_FLAG_CRCE                           (SPI_SR_CRCE)
#define LL_SPI_FLAG_MODF                           (SPI_SR_MODF)
#define LL_SPI_FLAG_OVR                            (SPI_SR_OVR)
#define LL_SPI_FLAG_TIFRE                          (SPI_SR_TIFRE)
#define LL_SPI_FLAG_SUSP                           (SPI_SR_SUSP)
#define LL_SPI_FLAG_TXC                            (SPI_SR_TXC)
#define LL_SPI_FLAG_RXWNE                          (SPI_SR_RXWNE)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_SPI_ReadReg and  LL_SPI_WriteReg functions.
  * @{
  */
#define LL_SPI_IT_RXP                              (SPI_IER_RXPIE)
#define LL_SPI_IT_TXP                              (SPI_IER_TXPIE)
#define LL_SPI_IT_DXP                              (SPI_IER_DXPIE)
#define LL_SPI_IT_EOT                              (SPI_IER_EOTIE)
#define LL_SPI_IT_TXTF                             (SPI_IER_TXTFIE)
#define LL_SPI_IT_UDR                              (SPI_IER_UDRIE)
#define LL_SPI_IT_OVR                              (SPI_IER_OVRIE)
#define LL_SPI_IT_CRCE                             (SPI_IER_CRCEIE)
#define LL_SPI_IT_TIFRE                            (SPI_IER_TIFREIE)
#define LL_SPI_IT_MODF                             (SPI_IER_MODFIE)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_MODE Mode
  * @{
  */
#define LL_SPI_MODE_MASTER                         (SPI_CFG2_MASTER)
#define LL_SPI_MODE_SLAVE                          (0x00000000UL)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_SS_LEVEL SS Level
  * @{
  */
#define LL_SPI_SS_LEVEL_HIGH                       (SPI_CR1_SSI)
#define LL_SPI_SS_LEVEL_LOW                        (0x00000000UL)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_NSS_MSSI Master Slave Select Idleness
  * @{
  */
#define LL_SPI_MSSI_DELAY_0_CYCLE                  (0x00000000UL)                                         /*!< No extra delay                     */
#define LL_SPI_MSSI_DELAY_1_CYCLE                  (SPI_CFG2_MSSI_0)                                      /*!< 1 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_2_CYCLE                  (SPI_CFG2_MSSI_1)                                      /*!< 2 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_3_CYCLE                  (SPI_CFG2_MSSI_0 | SPI_CFG2_MSSI_1)                    /*!< 3 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_4_CYCLE                  (SPI_CFG2_MSSI_2)                                      /*!< 4 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_5_CYCLE                  (SPI_CFG2_MSSI_2 | SPI_CFG2_MSSI_0)                    /*!< 5 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_6_CYCLE                  (SPI_CFG2_MSSI_2 | SPI_CFG2_MSSI_1)                    /*!< 6 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_7_CYCLE                  (SPI_CFG2_MSSI_2 | SPI_CFG2_MSSI_1 | SPI_CFG2_MSSI_0)  /*!< 7 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_8_CYCLE                  (SPI_CFG2_MSSI_3)                                      /*!< 8 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_9_CYCLE                  (SPI_CFG2_MSSI_3 | SPI_CFG2_MSSI_0)                    /*!< 9 clock cycle period delay added   */
#define LL_SPI_MSSI_DELAY_10_CYCLE                 (SPI_CFG2_MSSI_3 | SPI_CFG2_MSSI_1)                    /*!< 10 clock cycle period delay added  */
#define LL_SPI_MSSI_DELAY_11_CYCLE                 (SPI_CFG2_MSSI_3 | SPI_CFG2_MSSI_1 | SPI_CFG2_MSSI_0)  /*!< 11 clock cycle period delay added  */
#define LL_SPI_MSSI_DELAY_12_CYCLE                 (SPI_CFG2_MSSI_3 | SPI_CFG2_MSSI_2)                    /*!< 12 clock cycle period delay added  */
#define LL_SPI_MSSI_DELAY_13_CYCLE                 (SPI_CFG2_MSSI_3 | SPI_CFG2_MSSI_2 | SPI_CFG2_MSSI_0)  /*!< 13 clock cycle period delay added  */
#define LL_SPI_MSSI_DELAY_14_CYCLE                 (SPI_CFG2_MSSI_3 | SPI_CFG2_MSSI_2 | SPI_CFG2_MSSI_1)  /*!< 14 clock cycle period delay added  */
#define LL_SPI_MSSI_DELAY_15_CYCLE                 (SPI_CFG2_MSSI_3\
                                                    | SPI_CFG2_MSSI_2 | SPI_CFG2_MSSI_1 | SPI_CFG2_MSSI_0) /*!< 15 clock cycle period delay added  */
/**
  * @}
  */

