MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/** @defgroup SPI_LL_EC_ID_IDLENESS Master Inter-Data Idleness
  * @{
  */
#define LL_SPI_MIDI_DELAY_0_CYCLE                  (0x00000000UL)                                          /*!< No delay                      */
#define LL_SPI_MIDI_DELAY_1_CYCLE                  (SPI_CFG2_MIDI_0)                                       /*!< 1 clock cycle period delay    */
#define LL_SPI_MIDI_DELAY_2_CYCLE                  (SPI_CFG2_MIDI_1)                                       /*!< 2 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_3_CYCLE                  (SPI_CFG2_MIDI_0 | SPI_CFG2_MIDI_1)                     /*!< 3 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_4_CYCLE                  (SPI_CFG2_MIDI_2)                                       /*!< 4 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_5_CYCLE                  (SPI_CFG2_MIDI_2 | SPI_CFG2_MIDI_0)                     /*!< 5 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_6_CYCLE                  (SPI_CFG2_MIDI_2 | SPI_CFG2_MIDI_1)                     /*!< 6 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_7_CYCLE                  (SPI_CFG2_MIDI_2 | SPI_CFG2_MIDI_1 | SPI_CFG2_MIDI_0)   /*!< 7 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_8_CYCLE                  (SPI_CFG2_MIDI_3)                                       /*!< 8 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_9_CYCLE                  (SPI_CFG2_MIDI_3 | SPI_CFG2_MIDI_0)                     /*!< 9 clock cycles period delay   */
#define LL_SPI_MIDI_DELAY_10_CYCLE                 (SPI_CFG2_MIDI_3 | SPI_CFG2_MIDI_1)                     /*!< 10 clock cycles period delay  */
#define LL_SPI_MIDI_DELAY_11_CYCLE                 (SPI_CFG2_MIDI_3 | SPI_CFG2_MIDI_1 | SPI_CFG2_MIDI_0)   /*!< 11 clock cycles period delay  */
#define LL_SPI_MIDI_DELAY_12_CYCLE                 (SPI_CFG2_MIDI_3 | SPI_CFG2_MIDI_2)                     /*!< 12 clock cycles period delay  */
#define LL_SPI_MIDI_DELAY_13_CYCLE                 (SPI_CFG2_MIDI_3 | SPI_CFG2_MIDI_2 | SPI_CFG2_MIDI_0)   /*!< 13 clock cycles period delay  */
#define LL_SPI_MIDI_DELAY_14_CYCLE                 (SPI_CFG2_MIDI_3 | SPI_CFG2_MIDI_2 | SPI_CFG2_MIDI_1)   /*!< 14 clock cycles period delay  */
#define LL_SPI_MIDI_DELAY_15_CYCLE                 (SPI_CFG2_MIDI_3\
                                                    | SPI_CFG2_MIDI_2 | SPI_CFG2_MIDI_1 | SPI_CFG2_MIDI_0) /*!< 15 clock cycles period delay  */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_TXCRCINIT_ALL TXCRC Init All
  * @{
  */
#define LL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO        (0x00000000UL)    /*!< CRC TX Initialization patterns configured to zero  */
#define LL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE         (SPI_CR1_TCRCINI) /*!< CRC TX Initialization patterns configured to one   */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_RXCRCINIT_ALL RXCRC Init All
  * @{
  */
#define LL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO        (0x00000000UL)    /*!< CRC RX Initialization patterns configured to zero  */
#define LL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE         (SPI_CR1_RCRCINI) /*!< CRC RX Initialization patterns configured to one   */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_UDR_CONFIG_REGISTER UDR Config Register
  * @{
  */
#define LL_SPI_UNDERRUN_CONFIG_REGISTER_PATTERN    (0x00000000UL)
#define LL_SPI_UNDERRUN_CONFIG_LAST_RECEIVED       (SPI_CFG1_UDRCFG)    /*!< Slave repeats last received data from master */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_PROTOCOL Protocol
  * @{
  */
#define LL_SPI_PROTOCOL_MOTOROLA                   (0x00000000UL)    /*!< MOTOROLA protocol is used (most common protocol)  */
#define LL_SPI_PROTOCOL_TI                         (SPI_CFG2_SP_0)   /*!< TI protocol is used */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_PHASE Phase
  * @{
  */
#define LL_SPI_CLOCK_PHASE_1_EDGE                   (0x00000000UL)    /*!< The first clock transition is the first data capture edge  */
#define LL_SPI_CLOCK_PHASE_2_EDGE                   (SPI_CFG2_CPHA)   /*!< The second clock transition is the first data capture edge  */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_POLARITY Polarity
  * @{
  */
#define LL_SPI_CLOCK_POLARITY_LOW                  (0x00000000UL)     /*!< SCK signal is at 0 when idle */
#define LL_SPI_CLOCK_POLARITY_HIGH                 (SPI_CFG2_CPOL)    /*!< SCK signal is at 1 when idle */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_NSS_POLARITY NSS Polarity
  * @{
  */
#define LL_SPI_NSS_POLARITY_LOW                    (0x00000000UL)     /*!< Low level is active for slave select signal  */
#define LL_SPI_NSS_POLARITY_HIGH                   (SPI_CFG2_SSIOP)   /*!< High level is active for slave select signal */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_BAUDRATEPRESCALER Baud Rate Prescaler
  * @{
  */
#define LL_SPI_BAUD_RATE_PRESCALER_BYPASS           (SPI_CFG1_BPASS)   /*!< Bypass from RCC in Master mode   */
#define LL_SPI_BAUD_RATE_PRESCALER_2                (0x00000000UL)                                     /*!< SPI master clock/2   */
#define LL_SPI_BAUD_RATE_PRESCALER_4                (SPI_CFG1_MBR_0)                                   /*!< SPI master clock/4   */
#define LL_SPI_BAUD_RATE_PRESCALER_8                (SPI_CFG1_MBR_1)                                   /*!< SPI master clock/8   */
#define LL_SPI_BAUD_RATE_PRESCALER_16               (SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0)                  /*!< SPI master clock/16  */
#define LL_SPI_BAUD_RATE_PRESCALER_32               (SPI_CFG1_MBR_2)                                   /*!< SPI master clock/32  */
#define LL_SPI_BAUD_RATE_PRESCALER_64               (SPI_CFG1_MBR_2 | SPI_CFG1_MBR_0)                  /*!< SPI master clock/64  */
#define LL_SPI_BAUD_RATE_PRESCALER_128              (SPI_CFG1_MBR_2 | SPI_CFG1_MBR_1)                  /*!< SPI master clock/128 */
#define LL_SPI_BAUD_RATE_PRESCALER_256              (SPI_CFG1_MBR_2 | SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0) /*!< SPI master clock/256 */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_BIT_ORDER Bit Order
  * @{
  */
#define LL_SPI_LSB_FIRST                           (SPI_CFG2_LSBFRST)      /*!< LSB transmitted first  */
#define LL_SPI_MSB_FIRST                           (0x00000000UL)          /*!< MSB transmitted first  */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_TRANSFER_DIRECTION Transfer Direction
  * @brief    Direction defines.
  * @{
  */
#define LL_SPI_FULL_DUPLEX                         (0x00000000UL)                       /*!< Full-duplex communication                  */
#define LL_SPI_SIMPLEX_TX                          (SPI_CFG2_COMM_0)                    /*!< Simplex communication mode: Transmit only  */
#define LL_SPI_SIMPLEX_RX                          (SPI_CFG2_COMM_1)                    /*!< Simplex communication mode: Receive only   */
#define LL_SPI_HALF_DUPLEX                         (SPI_CFG2_COMM_0|SPI_CFG2_COMM_1)    /*!< Half-duplex communication                  */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_HALF_DUPLEX_DIRECTION Half Duplex Direction
  * @{
  */
#define  LL_SPI_HALF_DUPLEX_RX                     (0x00000000UL)      /*!< Half-duplex in reception mode    */
#define  LL_SPI_HALF_DUPLEX_TX                     (SPI_CR1_HDDIR)     /*!< Half-duplex in transmission mode */
/**
  * @}
  */

