MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/** @defgroup SPI_LL_EC_DATAWIDTH Data Width
  * @{
  */
#define LL_SPI_DATA_WIDTH_4_BIT                     (SPI_CFG1_DSIZE_0 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_5_BIT                     (SPI_CFG1_DSIZE_2)
#define LL_SPI_DATA_WIDTH_6_BIT                     (SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_7_BIT                     (SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_8_BIT                     (SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_9_BIT                     (SPI_CFG1_DSIZE_3)
#define LL_SPI_DATA_WIDTH_10_BIT                    (SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_11_BIT                    (SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_12_BIT                    (SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_13_BIT                    (SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2)
#define LL_SPI_DATA_WIDTH_14_BIT                    (SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_15_BIT                    (SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_16_BIT                    (SPI_CFG1_DSIZE_3\
                                                     | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_17_BIT                    (SPI_CFG1_DSIZE_4)
#define LL_SPI_DATA_WIDTH_18_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_19_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_20_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_0 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_21_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2)
#define LL_SPI_DATA_WIDTH_22_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_23_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_24_BIT                    (SPI_CFG1_DSIZE_4\
                                                     | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_25_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3)
#define LL_SPI_DATA_WIDTH_26_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_27_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_28_BIT                    (SPI_CFG1_DSIZE_4\
                                                     | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_29_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2)
#define LL_SPI_DATA_WIDTH_30_BIT                    (SPI_CFG1_DSIZE_4\
                                                     | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_0)
#define LL_SPI_DATA_WIDTH_31_BIT                    (SPI_CFG1_DSIZE_4\
                                                     | SPI_CFG1_DSIZE_3 | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1)
#define LL_SPI_DATA_WIDTH_32_BIT                    (SPI_CFG1_DSIZE_4 | SPI_CFG1_DSIZE_3\
                                                     | SPI_CFG1_DSIZE_2 | SPI_CFG1_DSIZE_1 | SPI_CFG1_DSIZE_0)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_FIFO_TH FIFO Threshold
  * @{
  */
#define LL_SPI_FIFO_THRESHOLD_1_DATA               (0x00000000UL)
#define LL_SPI_FIFO_THRESHOLD_2_DATA               (SPI_CFG1_FTHLV_0)
#define LL_SPI_FIFO_THRESHOLD_3_DATA               (SPI_CFG1_FTHLV_1)
#define LL_SPI_FIFO_THRESHOLD_4_DATA               (SPI_CFG1_FTHLV_0 | SPI_CFG1_FTHLV_1)
#define LL_SPI_FIFO_THRESHOLD_5_DATA               (SPI_CFG1_FTHLV_2)
#define LL_SPI_FIFO_THRESHOLD_6_DATA               (SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0)
#define LL_SPI_FIFO_THRESHOLD_7_DATA               (SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1)
#define LL_SPI_FIFO_THRESHOLD_8_DATA               (SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0)
#define LL_SPI_FIFO_THRESHOLD_9_DATA               (SPI_CFG1_FTHLV_3)
#define LL_SPI_FIFO_THRESHOLD_10_DATA              (SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_0)
#define LL_SPI_FIFO_THRESHOLD_11_DATA              (SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_1)
#define LL_SPI_FIFO_THRESHOLD_12_DATA              (SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0)
#define LL_SPI_FIFO_THRESHOLD_13_DATA              (SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2)
#define LL_SPI_FIFO_THRESHOLD_14_DATA              (SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0)
#define LL_SPI_FIFO_THRESHOLD_15_DATA              (SPI_CFG1_FTHLV_3 | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1)
#define LL_SPI_FIFO_THRESHOLD_16_DATA              (SPI_CFG1_FTHLV_3\
                                                    | SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_CRC CRC
  * @{
  */
#define LL_SPI_CRC_LENGTH_4_BIT                     (SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_5_BIT                     (SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_LENGTH_6_BIT                     (SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_7_BIT                     (SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_8_BIT                     (SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_9_BIT                     (SPI_CFG1_CRCSIZE_3)
#define LL_SPI_CRC_LENGTH_10_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_11_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_12_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_13_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_LENGTH_14_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_15_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_16_BIT                    (SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2  \
                                                     | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_17_BIT                    (SPI_CFG1_CRCSIZE_4)
#define LL_SPI_CRC_LENGTH_18_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_19_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_20_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_0 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_21_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_LENGTH_22_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_23_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_24_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_2  \
                                                     | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_25_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3)
#define LL_SPI_CRC_LENGTH_26_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_27_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_28_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3  \
                                                     | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_29_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3 | SPI_CFG1_CRCSIZE_2)
#define LL_SPI_CRC_LENGTH_30_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3  \
                                                     | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_0)
#define LL_SPI_CRC_LENGTH_31_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3  \
                                                     | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1)
#define LL_SPI_CRC_LENGTH_32_BIT                    (SPI_CFG1_CRCSIZE_4 | SPI_CFG1_CRCSIZE_3  \
                                                     | SPI_CFG1_CRCSIZE_2 | SPI_CFG1_CRCSIZE_1 | SPI_CFG1_CRCSIZE_0)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_NSS_MODE NSS Mode
  * @{
  */
/** In this configuration the Slave select is driven internally.
  * The external slave select pin is free for other application uses.
  */
#define LL_SPI_NSS_SOFT                            (SPI_CFG2_SSM)

/** In Slave mode, the slave select pin works as a standard chip select input and the slave
  * is selected while the slave select line is at its active level. In Master mode, this
  * configuration allows multi-master capability. If the slave select pin is pulled into
  * an active level in this mode, the SPI enters Master mode fault state and the SPI
  * device is automatically reconfigured in Slave mode (MASTER = 0)
  */
#define LL_SPI_NSS_HARD_INPUT                      (0x00000000UL)

