MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/** This configuration is only used when the MCU is set as master (multi-master not
  * allowed). The slave select pin active level is managed by the hardware. The
  * functionality is tied to CSTART and EOT control.
  */
#define LL_SPI_NSS_HARD_OUTPUT                     (SPI_CFG2_SSOE)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_RX_FIFO RxFIFO Packing LeVel
  * @{
  */
#define LL_SPI_RX_FIFO_0PACKET               (0x00000000UL)    /* 0 or multiple of 4 packet available is the RxFIFO */
#define LL_SPI_RX_FIFO_1PACKET               (SPI_SR_RXPLVL_0)
#define LL_SPI_RX_FIFO_2PACKET               (SPI_SR_RXPLVL_1)
#define LL_SPI_RX_FIFO_3PACKET               (SPI_SR_RXPLVL_1 | SPI_SR_RXPLVL_0)
/**
  * @}
  */

/** @defgroup SPI_LL_EC_CR1_MASRX  Master Receiver Automatic Suspension
  * @brief    SPI Master Receiver Automatic Suspension.
  * @{
  */
#define LL_SPI_MASTER_RX_AUTO_SUSPEND_DISABLE          0x00000000U
#define LL_SPI_MASTER_RX_AUTO_SUSPEND_ENABLE           SPI_CR1_MASRX
/**
  * @}
  */

/** @defgroup SPI_LL_EC_CFG2_AFCNTR  Keep IO State
  * @brief    SPI Keep IO State.
  * @{
  */
#define LL_SPI_MASTER_KEEP_IO_STATE_DISABLE        0x00000000U
#define LL_SPI_MASTER_KEEP_IO_STATE_ENABLE         SPI_CFG2_AFCNTR
/**
  * @}
  */

/** @defgroup SPI_LL_EC_NSSP_Mode NSS Pulse Mode
  * @brief    SPI NSS Pulse Mode.
  * @{
  */
#define LL_SPI_NSS_PULSE_DISABLE                   (0x00000000UL)  /*!< Slave select IO pin is kept at active level till data transfer is   \
                                                                        completed, it becomes inactive with EOT flag  */
#define LL_SPI_NSS_PULSE_ENABLE                    (SPI_CFG2_SSOM) /*!< SPI data frames are interleaved with slave select IO pin non active \
                                                                        pulses when MIDI[3:0]>1  */
/**
  * @}
  */

/** @defgroup SPI_LL_EC_MOSI_MISO_SWAP Swap MISO and MOSI pins
  * @brief    SPI Swap MISO and MOSI pins.
  * @{
  */
#define LL_SPI_MOSI_MISO_SWAP_DISABLE           (0x00000000UL)
#define LL_SPI_MOSI_MISO_SWAP_ENABLE            (SPI_CFG2_IOSWP)
/**
  * @}
  */
/** @defgroup SPI_LL_EC_RDY_PIN_POLARITY Ready pin input/output polarity
  * @brief    SPI Ready pin input/output polarity.
  * @{
  */
#define LL_SPI_READY_PIN_POLARITY_HIGH          (0x00000000UL)
#define LL_SPI_READY_PIN_POLARITY_LOW           (SPI_CFG2_RDIOP)
/**
  * @}
  */


/** @defgroup SPI_LL_EC_RDY_PIN_MASTER_MANAGEMENT Ready Pin Input Master Management
  * @brief    SPI Ready Pin Input Master Management.
  * @{
  */
#define  LL_SPI_READY_PIN_MASTER_MANAGEMENT_INTERNALLY          (0x00000000UL)
#define  LL_SPI_READY_PIN_MASTER_MANAGEMENT_EXTERNALLY          SPI_CFG2_RDIOM
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SPI_LL_Exported_Macros LL SPI Macros
  * @{
  */

/** @defgroup SPI_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in SPI register.
  * @param  __INSTANCE__ SPI Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  */
#define LL_SPI_WRITE_REG(__INSTANCE__, __REG__, __VALUE__) STM32_WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in SPI register.
  * @param  __INSTANCE__ SPI Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_SPI_READ_REG(__INSTANCE__, __REG__) STM32_READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/

/** @defgroup SPI_LL_Exported_Functions LL SPI Functions
  * @{
  */

/** @defgroup SPI_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable SPI peripheral.
  * @rmtoll
  *  CR1          SPE           LL_SPI_Enable
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_Enable(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_SPE);
}

/**
  * @brief  Disable SPI peripheral.
  * @rmtoll
  *  CR1          SPE           LL_SPI_Disable
  * @param  p_spix SPI Instance
  * @note   When disabling the SPI, follow the procedure described in the Reference Manual.
  */
__STATIC_INLINE void LL_SPI_Disable(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CR1, SPI_CR1_SPE);
}

/**
  * @brief  Check if SPI peripheral is enabled.
  * @rmtoll
  *  CR1          SPE           LL_SPI_IsEnabled
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabled(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CR1, SPI_CR1_SPE) == (SPI_CR1_SPE)) ? 1UL : 0UL);
}

/**
  * @brief  Swap the MOSI and MISO pin.
  * @rmtoll
  *  CFG2         IOSWP         LL_SPI_EnableMosiMisoSwap
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_EnableMosiMisoSwap(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG2, SPI_CFG2_IOSWP);
}

/**
  * @brief  Restore default function for MOSI and MISO pin.
  * @rmtoll
  *  CFG2         IOSWP         LL_SPI_DisableMosiMisoSwap
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_DisableMosiMisoSwap(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG2, SPI_CFG2_IOSWP);
}

/**
  * @brief  Check if MOSI and MISO pin are swapped.
  * @rmtoll
  *  CFG2         IOSWP         LL_SPI_IsEnabledMosiMisoSwap
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledMosiMisoSwap(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_IOSWP) == (SPI_CFG2_IOSWP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIO control.
  * @rmtoll
  *  CFG2         AFCNTR        LL_SPI_EnableGPIOControl
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_EnableGPIOControl(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG2, SPI_CFG2_AFCNTR);
}

/**
  * @brief  Disable GPIO control.
  * @rmtoll
  *  CFG2         AFCNTR        LL_SPI_DisableGPIOControl
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_DisableGPIOControl(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG2, SPI_CFG2_AFCNTR);
}

/**
  * @brief  Check if GPIO control is active.
  * @rmtoll
  *  CFG2         AFCNTR        LL_SPI_IsEnabledGPIOControl
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledGPIOControl(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_AFCNTR) == (SPI_CFG2_AFCNTR)) ? 1UL : 0UL);
}

/**
  * @brief  Set SPI Mode to Master or Slave.
  * @rmtoll
  *  CFG2         MASTER        LL_SPI_SetMode
  * @param  p_spix SPI Instance
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_SPI_MODE_MASTER
  *         @arg @ref LL_SPI_MODE_SLAVE
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetMode(SPI_TypeDef *p_spix, uint32_t mode)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_MASTER, mode);
}

/**
  * @brief  Get SPI Mode (Master or Slave).
  * @rmtoll
  *  CFG2         MASTER        LL_SPI_GetMode
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_MODE_MASTER
  *         @arg @ref LL_SPI_MODE_SLAVE
  */
__STATIC_INLINE uint32_t LL_SPI_GetMode(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_MASTER));
}

/**
  * @brief  Configure the Idleness applied by master between active edge of SS and first send data.
  * @rmtoll
  *  CFG2         MSSI          LL_SPI_SetMasterSSIdleness
  * @param  p_spix SPI Instance
  * @param  master_ss_idleness This parameter can be one of the following values:
  *         @arg @ref LL_SPI_MSSI_DELAY_0_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_1_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_2_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_3_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_4_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_5_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_6_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_7_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_8_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_9_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_10_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_11_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_12_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_13_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_14_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_15_CYCLE
  */
__STATIC_INLINE void LL_SPI_SetMasterSSIdleness(SPI_TypeDef *p_spix, uint32_t master_ss_idleness)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_MSSI, master_ss_idleness);
}

/**
  * @brief  Get the configured Idleness applied by master.
  * @rmtoll
  *  CFG2         MSSI          LL_SPI_GetMasterSSIdleness
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_MSSI_DELAY_0_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_1_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_2_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_3_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_4_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_5_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_6_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_7_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_8_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_9_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_10_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_11_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_12_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_13_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_14_CYCLE
  *         @arg @ref LL_SPI_MSSI_DELAY_15_CYCLE
  */
__STATIC_INLINE uint32_t LL_SPI_GetMasterSSIdleness(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_MSSI));
}

/**
  * @brief  Configure the idleness applied by master between data frame.
  * @rmtoll
  *  CFG2         MIDI          LL_SPI_SetInterDataIdleness
  * @param  p_spix SPI Instance
  * @param  master_Inter_data_idleness This parameter can be one of the following values:
  *         @arg @ref LL_SPI_MIDI_DELAY_0_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_1_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_2_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_3_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_4_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_5_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_6_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_7_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_8_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_9_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_10_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_11_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_12_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_13_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_14_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_15_CYCLE
  */
__STATIC_INLINE void LL_SPI_SetInterDataIdleness(SPI_TypeDef *p_spix, uint32_t master_Inter_data_idleness)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_MIDI, master_Inter_data_idleness);
}

/**
  * @brief  Get the configured inter data idleness.
  * @rmtoll
  *  CFG2         MIDI          LL_SPI_SetInterDataIdleness
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_MIDI_DELAY_0_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_1_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_2_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_3_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_4_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_5_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_6_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_7_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_8_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_9_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_10_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_11_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_12_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_13_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_14_CYCLE
  *         @arg @ref LL_SPI_MIDI_DELAY_15_CYCLE
  */
__STATIC_INLINE uint32_t LL_SPI_GetInterDataIdleness(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_MIDI));
}

/**
  * @brief  Set transfer size.
  * @rmtoll
  *  CR2          TSIZE         LL_SPI_SetTransferSize
  * @param  p_spix SPI Instance
  * @param  count 0..0xFFFF
  * @note    count is the number of frame to be transferred
  */
__STATIC_INLINE void LL_SPI_SetTransferSize(SPI_TypeDef *p_spix, uint32_t count)
{
  STM32_MODIFY_REG(p_spix->CR2, SPI_CR2_TSIZE, count);
}

/**
  * @brief  Get transfer size.
  * @rmtoll
  *  CR2          TSIZE         LL_SPI_GetTransferSize
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_GetTransferSize(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CR2, SPI_CR2_TSIZE));
}

/**
  * @brief  Lock the AF configuration of associated IOs.
  * @rmtoll
  *  CR1          IOLOCK        LL_SPI_EnableIOLock
  * @param  p_spix SPI Instance
  * @note   Once this bit is set, the AF configuration remains locked until a hardware reset occurs.
  *         the reset of the IOLock bit is done by hardware. for that, LL_SPI_DisableIOLock can not exist.
  */
__STATIC_INLINE void LL_SPI_EnableIOLock(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_IOLOCK);
}

/**
  * @brief  Check if the AF configuration is locked.
  * @rmtoll
  *  CR1          IOLOCK        LL_SPI_IsEnabledIOLock
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIOLock(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CR1, SPI_CR1_IOLOCK) == (SPI_CR1_IOLOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Set Tx CRC Initialization Pattern.
  * @rmtoll
  *  CR1          TCRCINI         LL_SPI_SetTxCRCInitPattern
  * @param  p_spix SPI Instance
  * @param  txcrc_init_all This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO
  *         @arg @ref LL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE
  */
__STATIC_INLINE void LL_SPI_SetTxCRCInitPattern(SPI_TypeDef *p_spix, uint32_t txcrc_init_all)
{
  STM32_MODIFY_REG(p_spix->CR1, SPI_CR1_TCRCINI, txcrc_init_all);
}

/**
  * @brief  Get Tx CRC Initialization Pattern.
  * @rmtoll
  *  CR1          TCRCINI         LL_SPI_GetTxCRCInitPattern
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO
  *         @arg @ref LL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE
  */
__STATIC_INLINE uint32_t LL_SPI_GetTxCRCInitPattern(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CR1, SPI_CR1_TCRCINI));
}

/**
  * @brief  Set Rx CRC Initialization Pattern.
  * @rmtoll
  *  CR1          RCRCINI         LL_SPI_SetRxCRCInitPattern
  * @param  p_spix SPI Instance
  * @param  rxcrc_init_all This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO
  *         @arg @ref LL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE
  */
__STATIC_INLINE void LL_SPI_SetRxCRCInitPattern(SPI_TypeDef *p_spix, uint32_t rxcrc_init_all)
{
  STM32_MODIFY_REG(p_spix->CR1, SPI_CR1_RCRCINI, rxcrc_init_all);
}

/**
  * @brief  Get Rx CRC Initialization Pattern.
  * @rmtoll
  *  CR1          RCRCINI         LL_SPI_GetRxCRCInitPattern
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO
  *         @arg @ref LL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE
  */
__STATIC_INLINE uint32_t LL_SPI_GetRxCRCInitPattern(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CR1, SPI_CR1_RCRCINI));
}

/**
  * @brief  Set CRC Initialization Pattern.
  * @rmtoll
  *  CR1          RCRCINI         LL_SPI_SetCRCInitPattern \n
  *  CR1          TCRCINI         LL_SPI_SetCRCInitPattern
  * @param  p_spix SPI Instance
  * @param  txcrc_init_all This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CRC_TX_INIT_PATTERN_ALL_ZERO
  *         @arg @ref LL_SPI_CRC_TX_INIT_PATTERN_ALL_ONE
  * @param  rxcrc_init_all This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CRC_RX_INIT_PATTERN_ALL_ZERO
  *         @arg @ref LL_SPI_CRC_RX_INIT_PATTERN_ALL_ONE
  */
__STATIC_INLINE void LL_SPI_SetCRCInitPattern(SPI_TypeDef *p_spix, uint32_t txcrc_init_all, uint32_t rxcrc_init_all)
{
  STM32_MODIFY_REG(p_spix->CR1, (SPI_CR1_RCRCINI | SPI_CR1_TCRCINI), txcrc_init_all | rxcrc_init_all);
}

/**
  * @brief  Get CRC Initialization Pattern.
  * @rmtoll
  *  CR1          RCRCINI         LL_SPI_GetRxCRCInitPattern \n
  *  CR1          TCRCINI         LL_SPI_GetRxCRCInitPattern
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE uint32_t LL_SPI_GetCRCInitPattern(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CR1, (SPI_CR1_TCRCINI | SPI_CR1_RCRCINI)));
}

/**
  * @brief  Set internal SS input level ignoring what comes from PIN.
  * @rmtoll
  *  CR1          SSI           LL_SPI_SetInternalSSLevel
  * @param  p_spix SPI Instance
  * @param  ss_level This parameter can be one of the following values:
  *         @arg @ref LL_SPI_SS_LEVEL_HIGH
  *         @arg @ref LL_SPI_SS_LEVEL_LOW
  * @note   This configuration has effect only with config LL_SPI_NSS_SOFT
  */
__STATIC_INLINE void LL_SPI_SetInternalSSLevel(SPI_TypeDef *p_spix, uint32_t ss_level)
{
  STM32_MODIFY_REG(p_spix->CR1, SPI_CR1_SSI, ss_level);
}

/**
  * @brief  Get internal SS input level.
  * @rmtoll
  *  CR1          SSI           LL_SPI_GetInternalSSLevel
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_SS_LEVEL_HIGH
  *         @arg @ref LL_SPI_SS_LEVEL_LOW
  */
__STATIC_INLINE uint32_t LL_SPI_GetInternalSSLevel(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CR1, SPI_CR1_SSI));
}

/**
  * @brief  Enable CRC computation on 33/17 bits.
  * @rmtoll
  *  CR1          CRC33_17      LL_SPI_EnableFullSizeCRC
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableFullSizeCRC(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_CRC33_17);
}

/**
  * @brief  Disable CRC computation on 33/17 bits.
  * @rmtoll
  *  CR1          CRC33_17      LL_SPI_DisableFullSizeCRC
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableFullSizeCRC(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CR1, SPI_CR1_CRC33_17);
}

/**
  * @brief  Check if Enable CRC computation on 33/17 bits is enabled.
  * @rmtoll
  *  CR1          CRC33_17      LL_SPI_IsEnabledFullSizeCRC
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledFullSizeCRC(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CR1, SPI_CR1_CRC33_17) == (SPI_CR1_CRC33_17)) ? 1UL : 0UL);
}

/**
  * @brief  Suspend an ongoing transfer for Master configuration.
  * @rmtoll
  *  CR1          CSUSP         LL_SPI_SuspendMasterTransfer
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_SuspendMasterTransfer(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_CSUSP);
}

/**
  * @brief  Start effective transfer on wire for Master configuration.
  * @rmtoll
  *  CR1          CSTART        LL_SPI_StartMasterTransfer
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_StartMasterTransfer(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_CSTART);
}

/**
  * @brief  Check if there is an unfinished master transfer.
  * @rmtoll
  *  CR1          CSTART        LL_SPI_IsActiveMasterTransfer
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveMasterTransfer(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CR1, SPI_CR1_CSTART) == (SPI_CR1_CSTART)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Master Rx auto suspend in case of overrun.
  * @rmtoll
  *  CR1          MASRX         LL_SPI_EnableMasterRxAutoSuspend
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableMasterRxAutoSuspend(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_MASRX);
}

/**
  * @brief  Disable Master Rx auto suspend in case of overrun.
  * @rmtoll
  *  CR1          MASRX         LL_SPI_DisableMasterRxAutoSuspend
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableMasterRxAutoSuspend(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CR1, SPI_CR1_MASRX);
}

/**
  * @brief  Check if Master Rx auto suspend is activated.
  * @rmtoll
  *  CR1          MASRX         LL_SPI_IsEnabledMasterRxAutoSuspend
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledMasterRxAutoSuspend(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CR1, SPI_CR1_MASRX) == (SPI_CR1_MASRX)) ? 1UL : 0UL);
}

/**
  * @brief  Set Underrun Configuration.
  * @rmtoll
  *  CFG1         UDRCFG        LL_SPI_SetUDRConfiguration
  * @param  p_spix SPI Instance
  * @param  udr_config This parameter can be one of the following values:
  *         @arg @ref LL_SPI_UNDERRUN_CONFIG_REGISTER_PATTERN
  *         @arg @ref LL_SPI_UNDERRUN_CONFIG_LAST_RECEIVED
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetUDRConfiguration(SPI_TypeDef *p_spix, uint32_t udr_config)
{
  STM32_MODIFY_REG(p_spix->CFG1, SPI_CFG1_UDRCFG, udr_config);
}

/**
  * @brief  Get Underrun Configuration.
  * @rmtoll
  *  CFG1         UDRCFG        LL_SPI_GetUDRConfiguration
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_UNDERRUN_CONFIG_REGISTER_PATTERN
  *         @arg @ref LL_SPI_UNDERRUN_CONFIG_LAST_RECEIVED
  */
__STATIC_INLINE uint32_t LL_SPI_GetUDRConfiguration(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_UDRCFG));
}


/**
  * @brief  Set Serial protocol used.
  * @rmtoll
  *  CFG2         SP            LL_SPI_SetStandard
  * @param  p_spix SPI Instance
  * @param  standard This parameter can be one of the following values:
  *         @arg @ref LL_SPI_PROTOCOL_MOTOROLA
  *         @arg @ref LL_SPI_PROTOCOL_TI
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetStandard(SPI_TypeDef *p_spix, uint32_t standard)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_SP, standard);
}

/**
  * @brief  Get Serial protocol used.
  * @rmtoll
  *  CFG2         SP            LL_SPI_GetStandard
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_PROTOCOL_MOTOROLA
  *         @arg @ref LL_SPI_PROTOCOL_TI
  */
__STATIC_INLINE uint32_t LL_SPI_GetStandard(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_SP));
}

/**
  * @brief  Set Clock phase.
  * @rmtoll
  *  CFG2         CPHA          LL_SPI_SetClockPhase
  * @param  p_spix SPI Instance
  * @param  clock_phase This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CLOCK_PHASE_1_EDGE
  *         @arg @ref LL_SPI_CLOCK_PHASE_2_EDGE
  * @note   This configuration can not be changed when SPI is enabled.
  *         This bit is not used in SPI TI mode.
  */
__STATIC_INLINE void LL_SPI_SetClockPhase(SPI_TypeDef *p_spix, uint32_t clock_phase)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_CPHA, clock_phase);
}

