MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/**
  * @brief  Get Clock phase.
  * @rmtoll
  *  CFG2         CPHA          LL_SPI_GetClockPhase
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_CLOCK_PHASE_1_EDGE
  *         @arg @ref LL_SPI_CLOCK_PHASE_2_EDGE
  */
__STATIC_INLINE uint32_t LL_SPI_GetClockPhase(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_CPHA));
}

/**
  * @brief  Set Clock polarity.
  * @rmtoll
  *  CFG2         CPOL          LL_SPI_SetClockPolarity
  * @param  p_spix SPI Instance
  * @param  clock_polarity This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CLOCK_POLARITY_LOW
  *         @arg @ref LL_SPI_CLOCK_POLARITY_HIGH
  * @note   This configuration can not be changed when SPI is enabled.
  *         This bit is not used in SPI TI mode.
  */
__STATIC_INLINE void LL_SPI_SetClockPolarity(SPI_TypeDef *p_spix, uint32_t clock_polarity)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_CPOL, clock_polarity);
}

/**
  * @brief  Get Clock polarity.
  * @rmtoll
  *  CFG2         CPOL          LL_SPI_GetClockPolarity
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_CLOCK_POLARITY_LOW
  *         @arg @ref LL_SPI_CLOCK_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t LL_SPI_GetClockPolarity(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_CPOL));
}

/**
  * @brief  Enable ReadyPin.
  * @rmtoll
  *  CFG2         RDIOM         LL_SPI_EnableReadyPin
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableReadyPin(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG2, LL_SPI_READY_PIN_MASTER_MANAGEMENT_EXTERNALLY);
}

/**
  * @brief  Disable ReadyPin.
  * @rmtoll
  *  CFG2         RDIOM         LL_SPI_DisableReadyPin
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableReadyPin(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG2, LL_SPI_READY_PIN_MASTER_MANAGEMENT_EXTERNALLY);
}

/**
  * @brief  Check if ReadyPin is enabled.
  * @rmtoll
  *  CFG2         RDIOM         LL_SPI_IsEnabledReadyPin
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledReadyPin(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_RDIOM) == SPI_CFG2_RDIOM) ? 1UL : 0UL);
}

/**
  * @brief  Set ReadyPin polarity.
  * @rmtoll
  *  CFG2         RDIOP         LL_SPI_SetReadyPinPolarity
  * @param  p_spix SPI Instance
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_SPI_READY_PIN_POLARITY_HIGH
  *         @arg @ref LL_SPI_READY_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_SPI_SetReadyPinPolarity(SPI_TypeDef *p_spix, uint32_t polarity)
{
  STM32_SET_BIT(p_spix->CFG2, polarity);
}

/**
  * @brief  Get ReadyPin polarity.
  * @rmtoll
  *  CFG2         RDIOP         LL_SPI_GetReadyPinPolarity
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_READY_PIN_POLARITY_HIGH
  *         @arg @ref LL_SPI_READY_PIN_POLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_SPI_GetReadyPinPolarity(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_RDIOP));
}

/**
  * @brief  Enable Delay Read Data Sampling.
  * @rmtoll
  *  CFG1         DRDS         LL_SPI_EnableDelayReadDataSampling
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableDelayReadDataSampling(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG1, SPI_CFG1_DRDS);
}

/**
  * @brief  Disable Delay Read Data Sampling.
  * @rmtoll
  *  CFG1         DRDS         LL_SPI_DisableDelayReadDataSampling
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableDelayReadDataSampling(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG1, SPI_CFG1_DRDS);
}

/**
  * @brief  Check if Delay Read Data Sampling feature is enabled.
  * @rmtoll
  *  CFG1         DRDS         LL_SPI_IsEnabledDelayReadDataSampling
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledDelayReadDataSampling(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_DRDS) == SPI_CFG1_DRDS) ? 1UL : 0UL);
}

/**
  * @brief  Set NSS polarity.
  * @rmtoll
  *  CFG2         SSIOP          LL_SPI_SetNSSPolarity
  * @param  p_spix SPI Instance
  * @param  nss_polarity This parameter can be one of the following values:
  *         @arg @ref LL_SPI_NSS_POLARITY_LOW
  *         @arg @ref LL_SPI_NSS_POLARITY_HIGH
  * @note   This configuration can not be changed when SPI is enabled.
  *         This bit is not used in SPI TI mode.
  */
__STATIC_INLINE void LL_SPI_SetNSSPolarity(SPI_TypeDef *p_spix, uint32_t nss_polarity)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_SSIOP, nss_polarity);
}

/**
  * @brief  Get NSS polarity.
  * @rmtoll
  *  CFG2         SSIOP          LL_SPI_GetNSSPolarity
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_NSS_POLARITY_LOW
  *         @arg @ref LL_SPI_NSS_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t LL_SPI_GetNSSPolarity(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_SSIOP));
}

/**
  * @brief  Set Baudrate Prescaler.
  * @rmtoll
  *  CFG1         MBR      LL_SPI_SetBaudRatePrescaler \n
  *  CFG1         BPASS    LL_SPI_SetBaudRatePrescaler
  * @param  p_spix SPI Instance
  * @param  baudrate This parameter can be one of the following values:
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_BYPASS
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_2
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_4
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_8
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_16
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_32
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_64
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_128
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_256
  * @note   This configuration can not be changed when SPI is enabled.
  *         SPI BaudRate = fPCLK/Prescaler.
  */
__STATIC_INLINE void LL_SPI_SetBaudRatePrescaler(SPI_TypeDef *p_spix, uint32_t baudrate)
{
  STM32_MODIFY_REG(p_spix->CFG1, (SPI_CFG1_MBR | SPI_CFG1_BPASS), baudrate);
}

/**
  * @brief  Get Baudrate Prescaler.
  * @rmtoll
  *  CFG1         MBR           LL_SPI_GetBaudRatePrescaler \n
  *  CFG1         BPASS         LL_SPI_GetBaudRatePrescaler
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_BYPASS
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_2
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_4
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_8
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_16
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_32
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_64
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_128
  *         @arg @ref LL_SPI_BAUD_RATE_PRESCALER_256
  */
__STATIC_INLINE uint32_t LL_SPI_GetBaudRatePrescaler(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG1, (SPI_CFG1_MBR | SPI_CFG1_BPASS)));
}

/**
  * @brief  Configure the SPI Bus.
  * @rmtoll
  *  CR1          SSI           LL_SPI_SetConfig \n
  *  CFG2         MASTER        LL_SPI_SetConfig \n
  *  CFG2         COMM          LL_SPI_SetConfig \n
  *  CFG2         CPOL          LL_SPI_SetConfig \n
  *  CFG2         CPHA          LL_SPI_SetConfig \n
  *  CFG2         LSBFRST       LL_SPI_SetConfig \n
  *  CFG1         DSIZE         LL_SPI_SetConfig \n
  *  CFG1         MBR           LL_SPI_SetConfig \n
  *  CFG1         BPASS         LL_SPI_SetConfig
  * @param  p_spix SPI Instance
  * @param cfg1_config This parameter can be a combination of the following groups:
  *         @arg @ref SPI_LL_EC_DATAWIDTH
  *         @arg @ref SPI_LL_EC_BAUDRATEPRESCALER
  * @param cfg2_config: This parameter must be a combination of mode,direction,clock polarity, clock phase, first bit
  *       and nss management mode from the following groups:
  *         @arg @ref SPI_LL_EC_MODE
  *         @arg @ref SPI_LL_EC_TRANSFER_DIRECTION
  *         @arg @ref SPI_LL_EC_POLARITY
  *         @arg @ref SPI_LL_EC_PHASE
  *         @arg @ref SPI_LL_EC_BIT_ORDER
  *         @arg @ref SPI_LL_EC_NSS_MODE
  * @note   This configuration can not be changed when SPI is enabled.
  * @note   LL_SPI_SetHalfDuplexDirection must be used to select the transfer direction in half duplex
  */
__STATIC_INLINE void LL_SPI_SetConfig(SPI_TypeDef *p_spix, uint32_t cfg1_config,
                                      uint32_t cfg2_config)
{
  uint32_t cfg2_reg_value = LL_SPI_READ_REG((p_spix), CFG2);

  if (((cfg2_config & (SPI_CFG2_SSOE | SPI_CFG2_SSM)) == LL_SPI_NSS_SOFT)
      && ((((cfg2_config & (SPI_CFG2_MASTER)) == LL_SPI_MODE_MASTER)
           && (STM32_IS_BIT_CLR(cfg2_reg_value, SPI_CFG2_SSIOP)))
          || (((cfg2_config & (SPI_CFG2_MASTER)) == LL_SPI_MODE_SLAVE)
              && (STM32_IS_BIT_SET(cfg2_reg_value, SPI_CFG2_SSIOP)))))
  {
    STM32_SET_BIT(p_spix->CR1, SPI_CR1_SSI);
  }
  else
  {
    STM32_CLEAR_BIT(p_spix->CR1, SPI_CR1_SSI);
  }
  STM32_MODIFY_REG(p_spix->CFG1, (SPI_CFG1_DSIZE | SPI_CFG1_MBR | SPI_CFG1_BPASS), cfg1_config);
  STM32_MODIFY_REG(p_spix->CFG2, (SPI_CFG2_SSOE | SPI_CFG2_SSM | SPI_CFG2_MASTER | SPI_CFG2_COMM |
                                  SPI_CFG2_CPOL | SPI_CFG2_CPHA | SPI_CFG2_LSBFRST), cfg2_config);
}

/**
  * @brief  Set Transfer Bit Order.
  * @rmtoll
  *  CFG2         LSBFRST       LL_SPI_SetTransferBitOrder
  * @param  p_spix SPI Instance
  * @param  bit_order This parameter can be one of the following values:
  *         @arg @ref LL_SPI_LSB_FIRST
  *         @arg @ref LL_SPI_MSB_FIRST
  * @note   This configuration can not be changed when SPI is enabled.
  *         This bit is not used in SPI TI mode.
  */
__STATIC_INLINE void LL_SPI_SetTransferBitOrder(SPI_TypeDef *p_spix, uint32_t bit_order)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_LSBFRST, bit_order);
}

/**
  * @brief  Get Transfer Bit Order.
  * @rmtoll
  *  CFG2         LSBFRST       LL_SPI_GetTransferBitOrder
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_LSB_FIRST
  *         @arg @ref LL_SPI_MSB_FIRST
  */
__STATIC_INLINE uint32_t LL_SPI_GetTransferBitOrder(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_LSBFRST));
}

/**
  * @brief  Set Transfer Mode.
  * @rmtoll
  *  CFG2         COMM          LL_SPI_SetTransferDirection
  * @param  p_spix SPI Instance
  * @param  transfer_direction This parameter can be one of the following values:
  *         @arg @ref LL_SPI_FULL_DUPLEX
  *         @arg @ref LL_SPI_SIMPLEX_TX
  *         @arg @ref LL_SPI_SIMPLEX_RX
  *         @arg @ref LL_SPI_HALF_DUPLEX
  * @note   This configuration can not be changed when SPI is enabled except for half duplex direction
  *         using LL_SPI_SetHalfDuplexDirection.
  */
__STATIC_INLINE void LL_SPI_SetTransferDirection(SPI_TypeDef *p_spix, uint32_t transfer_direction)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_COMM, transfer_direction & SPI_CFG2_COMM);
}

/**
  * @brief  Get Transfer Mode.
  * @rmtoll
  *  CFG2         COMM          LL_SPI_GetTransferDirection
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_FULL_DUPLEX
  *         @arg @ref LL_SPI_SIMPLEX_TX
  *         @arg @ref LL_SPI_SIMPLEX_RX
  *         @arg @ref LL_SPI_HALF_DUPLEX
  */
__STATIC_INLINE uint32_t LL_SPI_GetTransferDirection(const SPI_TypeDef *p_spix)
{
  return STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_COMM);
}

/**
  * @brief  Set direction for Half-Duplex Mode.
  * @rmtoll
  *  CR1          HDDIR         LL_SPI_SetHalfDuplexDirection
  * @param  p_spix SPI Instance
  * @param  half_duplex_direction This parameter can be one of the following values:
  *         @arg @ref LL_SPI_HALF_DUPLEX_RX
  *         @arg @ref LL_SPI_HALF_DUPLEX_TX
  * @note   In master mode the MOSI pin is used and in slave mode the MISO pin is used for Half-Duplex.
  */
__STATIC_INLINE void LL_SPI_SetHalfDuplexDirection(SPI_TypeDef *p_spix, uint32_t half_duplex_direction)
{
  STM32_MODIFY_REG(p_spix->CR1, SPI_CR1_HDDIR, half_duplex_direction & SPI_CR1_HDDIR);
}

/**
  * @brief  Get direction for Half-Duplex Mode.
  * @rmtoll
  *  CR1          HDDIR         LL_SPI_GetHalfDuplexDirection
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_HALF_DUPLEX_RX
  *         @arg @ref LL_SPI_HALF_DUPLEX_TX
  * @note   In master mode the MOSI pin is used and in slave mode the MISO pin is used for Half-Duplex.
  */
__STATIC_INLINE uint32_t LL_SPI_GetHalfDuplexDirection(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CR1, SPI_CR1_HDDIR));
}

/**
  * @brief  Check if the direction is Half duplex.
  * @rmtoll
  *  CFG2         COMM          LL_SPI_IsHalfDuplexDirection
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsHalfDuplexDirection(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_COMM) == SPI_CFG2_COMM) ? 1UL : 0UL);
}

/**
  * @brief  Set Frame Data Size.
  * @rmtoll
  *  CFG1         DSIZE         LL_SPI_SetDataWidth
  * @param  p_spix SPI Instance
  * @param  data_width This parameter can be one of the following values:
  *         @arg @ref LL_SPI_DATA_WIDTH_4_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_5_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_6_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_7_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_8_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_9_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_10_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_11_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_12_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_13_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_14_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_15_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_16_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_17_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_18_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_19_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_20_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_21_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_22_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_23_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_24_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_25_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_26_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_27_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_28_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_29_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_30_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_31_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_32_BIT
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetDataWidth(SPI_TypeDef *p_spix, uint32_t data_width)
{
  STM32_MODIFY_REG(p_spix->CFG1, SPI_CFG1_DSIZE, data_width);
}

/**
  * @brief  Get Frame Data Size.
  * @rmtoll
  *  CFG1         DSIZE         LL_SPI_GetDataWidth
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_DATA_WIDTH_4_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_5_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_6_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_7_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_8_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_9_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_10_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_11_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_12_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_13_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_14_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_15_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_16_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_17_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_18_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_19_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_20_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_21_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_22_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_23_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_24_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_25_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_26_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_27_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_28_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_29_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_30_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_31_BIT
  *         @arg @ref LL_SPI_DATA_WIDTH_32_BIT
  */
__STATIC_INLINE uint32_t LL_SPI_GetDataWidth(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_DSIZE));
}

/**
  * @brief  Set threshold of FIFO that triggers a transfer event.
  * @rmtoll
  *  CFG1         FTHLV         LL_SPI_SetFIFOThreshold
  * @param  p_spix SPI Instance
  * @param  threshold This parameter can be one of the following values:
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_1_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_2_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_3_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_4_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_5_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_6_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_7_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_8_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_9_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_10_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_11_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_12_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_13_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_14_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_15_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_16_DATA
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetFIFOThreshold(SPI_TypeDef *p_spix, uint32_t threshold)
{
  STM32_MODIFY_REG(p_spix->CFG1, SPI_CFG1_FTHLV, threshold);
}

/**
  * @brief  Get threshold of FIFO that triggers a transfer event.
  * @rmtoll
  *  CFG1         FTHLV         LL_SPI_GetFIFOThreshold
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_1_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_2_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_3_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_4_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_5_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_6_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_7_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_8_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_9_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_10_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_11_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_12_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_13_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_14_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_15_DATA
  *         @arg @ref LL_SPI_FIFO_THRESHOLD_16_DATA
  */
__STATIC_INLINE uint32_t LL_SPI_GetFIFOThreshold(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_FTHLV));
}

/**
  * @brief  Enable CRC.
  * @rmtoll
  *  CFG1         CRCEN         LL_SPI_EnableCRC
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_EnableCRC(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG1, SPI_CFG1_CRCEN);
}

/**
  * @brief  Disable CRC.
  * @rmtoll
  *  CFG1         CRCEN         LL_SPI_DisableCRC
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableCRC(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG1, SPI_CFG1_CRCEN);
}

/**
  * @brief  Check if CRC is enabled.
  * @rmtoll
  *  CFG1         CRCEN         LL_SPI_IsEnabledCRC
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledCRC(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_CRCEN) == SPI_CFG1_CRCEN) ? 1UL : 0UL);
}

/**
  * @brief  Set CRC Length.
  * @rmtoll
  *  CFG1         CRCSIZE       LL_SPI_SetCRCWidth
  * @param  p_spix SPI Instance
  * @param  crc_length This parameter can be one of the following values:
  *         @arg @ref LL_SPI_CRC_LENGTH_4_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_5_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_6_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_7_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_8_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_9_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_10_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_11_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_12_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_13_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_14_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_15_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_16_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_17_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_18_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_19_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_20_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_21_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_22_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_23_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_24_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_25_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_26_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_27_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_28_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_29_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_30_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_31_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_32_BIT
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetCRCWidth(SPI_TypeDef *p_spix, uint32_t crc_length)
{
  STM32_MODIFY_REG(p_spix->CFG1, SPI_CFG1_CRCSIZE, crc_length);
}

/**
  * @brief  Get CRC Length.
  * @rmtoll
  *  CFG1          CRCSIZE       LL_SPI_GetCRCWidth
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_CRC_LENGTH_4_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_5_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_6_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_7_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_8_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_9_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_10_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_11_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_12_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_13_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_14_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_15_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_16_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_17_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_18_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_19_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_20_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_21_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_22_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_23_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_24_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_25_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_26_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_27_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_28_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_29_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_30_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_31_BIT
  *         @arg @ref LL_SPI_CRC_LENGTH_32_BIT
  */
__STATIC_INLINE uint32_t LL_SPI_GetCRCWidth(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_CRCSIZE));
}

