MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/**
  * @brief  Set NSS Mode.
  *         This bit is not used in SPI TI mode.
  * @rmtoll
  *  CFG2         SSM           LL_SPI_SetNSSMode \n
  *  CFG2         SSOE          LL_SPI_SetNSSMode
  * @param  p_spix SPI Instance
  * @param  nss This parameter can be one of the following values:
  *         @arg @ref LL_SPI_NSS_SOFT
  *         @arg @ref LL_SPI_NSS_HARD_INPUT
  *         @arg @ref LL_SPI_NSS_HARD_OUTPUT
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_SetNSSMode(SPI_TypeDef *p_spix, uint32_t nss)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_SSM | SPI_CFG2_SSOE, nss);
}

/**
  * @brief  Get NSS Mode.
  * @rmtoll
  *  CFG2         SSM           LL_SPI_GetNSSMode \n
  *  CFG2         SSOE          LL_SPI_GetNSSMode
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_NSS_SOFT
  *         @arg @ref LL_SPI_NSS_HARD_INPUT
  *         @arg @ref LL_SPI_NSS_HARD_OUTPUT
  */
__STATIC_INLINE uint32_t LL_SPI_GetNSSMode(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_SSM | SPI_CFG2_SSOE));
}

/**
  * @brief  Enable NSS pulse mgt.
  *         This bit is not used in SPI TI mode.
  * @rmtoll
  *  CFG2         SSOM          LL_SPI_EnableNSSPulseMgt
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  */
__STATIC_INLINE void LL_SPI_EnableNSSPulseMgt(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG2, SPI_CFG2_SSOM);
}

/**
  * @brief  Disable NSS pulse mgt.
  * @rmtoll
  *  CFG2         SSOM          LL_SPI_DisableNSSPulseMgt
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when SPI is enabled.
  *         This bit is not used in SPI TI mode.
  */
__STATIC_INLINE void LL_SPI_DisableNSSPulseMgt(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG2, SPI_CFG2_SSOM);
}

/**
  * @brief  Check if NSS pulse is enabled.
  * @rmtoll
  *  CFG2         SSOM          LL_SPI_IsEnabledNSSPulse
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledNSSPulse(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG2, SPI_CFG2_SSOM) == SPI_CFG2_SSOM) ? 1UL : 0UL);
}

/**
  * @brief  Set NSS Config.
  * @rmtoll
  *  CFG2         SSIOP          LL_SPI_SetNSSConfig \n
  *  CFG2         SSOM           LL_SPI_SetNSSConfig \n
  *  CFG2         MSSI           LL_SPI_SetNSSConfig
  * @param  p_spix SPI Instance
  * @param  cfg2_config This parameter must be a combination of the following values:
  *         @arg @ref SPI_LL_EC_NSS_POLARITY
  *         @arg @ref SPI_LL_EC_NSS_MSSI
  *         @arg @ref SPI_LL_EC_NSSP_Mode
  * @note   This configuration can not be changed when SPI is enabled.
  *         Those bits are not used in SPI TI mode.
  */
__STATIC_INLINE void LL_SPI_SetNSSConfig(SPI_TypeDef *p_spix, uint32_t cfg2_config)
{
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_SSIOP | SPI_CFG2_SSOM | SPI_CFG2_MSSI, cfg2_config);
}

/**
  * @brief  Get NSS Config.
  * @rmtoll
  *  CFG2         SSIOP          LL_SPI_GetNSSConfig \n
  *  CFG2         SSOM           LL_SPI_GetNSSConfig \n
  *  CFG2         MSSI           LL_SPI_GetNSSConfig
  * @param  p_spix SPI Instance
  * @retval This function returns a combination of the following values:
  *         @arg @ref SPI_LL_EC_NSS_POLARITY
  *         @arg @ref SPI_LL_EC_NSS_MSSI
  *         @arg @ref SPI_LL_EC_NSSP_Mode
  * @note   This configuration can not be changed when SPI is enabled.
  *         Those bits are not used in SPI TI mode.
  */
__STATIC_INLINE uint32_t LL_SPI_GetNSSConfig(const SPI_TypeDef *p_spix)
{
  return STM32_READ_REG(p_spix->CFG2) & (SPI_CFG2_SSIOP | SPI_CFG2_SSOM | SPI_CFG2_MSSI);
}

/**
  * @}
  */

/** @defgroup SPI_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Indicate the status of a mask of flags.
  * @rmtoll
  *  SR    SPI_SR_RXP        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_TXP        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_DXP        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_EOT        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_TXTF       LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_UDR        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_CRCE       LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_MODF       LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_OVR        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_TIFRE      LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_SUSP       LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_TXC        LL_SPI_IsActiveFlag \n
  *  SR    SPI_SR_RXWNE      LL_SPI_IsActiveFlag
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_SPI_FLAG_RXP
  *            @arg @ref  LL_SPI_FLAG_TXP
  *            @arg @ref  LL_SPI_FLAG_DXP
  *            @arg @ref  LL_SPI_FLAG_EOT
  *            @arg @ref  LL_SPI_FLAG_TXTF
  *            @arg @ref  LL_SPI_FLAG_UDR
  *            @arg @ref  LL_SPI_FLAG_CRCE
  *            @arg @ref  LL_SPI_FLAG_MODF
  *            @arg @ref  LL_SPI_FLAG_OVR
  *            @arg @ref  LL_SPI_FLAG_TIFRE
  *            @arg @ref  LL_SPI_FLAG_SUSP
  *            @arg @ref  LL_SPI_FLAG_TXC
  *            @arg @ref  LL_SPI_FLAG_RXWNE
  * @retval State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag(const SPI_TypeDef *p_spix, uint32_t mask)
{
  return ((STM32_READ_BIT(p_spix->SR, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Check if there is enough data in FIFO to read a full packet.
  * @rmtoll
  *  SR           RXP           LL_SPI_IsActiveFlag_RXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_RXP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_RXP) == (SPI_SR_RXP)) ? 1UL : 0UL);
}

/**
  * @brief  Check if there is enough space in FIFO to hold a full packet.
  * @rmtoll
  *  SR           TXP           LL_SPI_IsActiveFlag_TXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_TXP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_TXP) == (SPI_SR_TXP)) ? 1UL : 0UL);
}

/**
  * @brief  Check if there enough space in FIFO to hold a full packet, AND enough data to read a full packet.
  * @rmtoll
  *  SR           DXP           LL_SPI_IsActiveFlag_DXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_DXP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_DXP) == (SPI_SR_DXP)) ? 1UL : 0UL);
}

/**
  * @brief  Check that end of transfer event occurred.
  * @rmtoll
  *  SR           EOT           LL_SPI_IsActiveFlag_EOT
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_EOT(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_EOT) == (SPI_SR_EOT)) ? 1UL : 0UL);
}

/**
  * @brief  Check that all required data has been filled in the fifo according to transfer size.
  * @rmtoll
  *  SR           TXTF          LL_SPI_IsActiveFlag_TXTF
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_TXTF(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_TXTF) == (SPI_SR_TXTF)) ? 1UL : 0UL);
}

/**
  * @brief  Get Underrun error flag.
  * @rmtoll
  *  SR           UDR           LL_SPI_IsActiveFlag_UDR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_UDR(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_UDR) == (SPI_SR_UDR)) ? 1UL : 0UL);
}

/**
  * @brief  Get CRC error flag.
  * @rmtoll
  *  SR           CRCE        LL_SPI_IsActiveFlag_CRCERR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_CRCERR(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_CRCE) == (SPI_SR_CRCE)) ? 1UL : 0UL);
}

/**
  * @brief  Get Mode fault error flag.
  * @rmtoll
  *  SR           MODF          LL_SPI_IsActiveFlag_MODF
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_MODF(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_MODF) == (SPI_SR_MODF)) ? 1UL : 0UL);
}

/**
  * @brief  Get Overrun error flag.
  * @rmtoll
  *  SR           OVR           LL_SPI_IsActiveFlag_OVR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_OVR(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_OVR) == (SPI_SR_OVR)) ? 1UL : 0UL);
}

/**
  * @brief  Get TI Frame format error flag.
  * @rmtoll
  *  SR           TIFRE         LL_SPI_IsActiveFlag_FRE
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_FRE(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_TIFRE) == (SPI_SR_TIFRE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if a suspend operation is done.
  * @rmtoll
  *  SR           SUSP          LL_SPI_IsActiveFlag_SUSP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_SUSP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_SUSP) == (SPI_SR_SUSP)) ? 1UL : 0UL);
}

/**
  * @brief  Check if last TxFIFO or CRC frame transmission is completed.
  * @rmtoll
  *  SR           TXC           LL_SPI_IsActiveFlag_TXC
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_TXC(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_TXC) == (SPI_SR_TXC)) ? 1UL : 0UL);
}

/**
  * @brief  Check if at least one 32-bit data is available in RxFIFO.
  * @rmtoll
  *  SR           RXWNE         LL_SPI_IsActiveFlag_RXWNE
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_RXWNE(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->SR, SPI_SR_RXWNE) == (SPI_SR_RXWNE)) ? 1UL : 0UL);
}

/**
  * @brief  Get number of data framed remaining in current TSIZE.
  * @rmtoll
  *  SR           CTSIZE           LL_SPI_GetRemainingDataFrames
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_GetRemainingDataFrames(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->SR, SPI_SR_CTSIZE) >> SPI_SR_CTSIZE_Pos);
}

/**
  * @brief  Get RxFIFO packing Level.
  * @rmtoll
  *  SR           RXPLVL        LL_SPI_GetRxFIFOPackingLevel
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SPI_RX_FIFO_0PACKET
  *         @arg @ref LL_SPI_RX_FIFO_1PACKET
  *         @arg @ref LL_SPI_RX_FIFO_2PACKET
  *         @arg @ref LL_SPI_RX_FIFO_3PACKET
  */
__STATIC_INLINE uint32_t LL_SPI_GetRxFIFOPackingLevel(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->SR, SPI_SR_RXPLVL));
}

/**
  * @brief  Clear the status of a mask of flags.
  * @rmtoll
  *  IFCR    SPI_IFCR_EOT    LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_TXTF   LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_UDR    LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_CRCE   LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_MODF   LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_OVR    LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_TIFRE  LL_SPI_ClearFlag \n
  *  IFCR    SPI_IFCR_SUSP   LL_SPI_ClearFlag
  * @param  p_spix SPI Instance.
  * @param  mask Flags to clear.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_SPI_FLAG_EOT
  *            @arg @ref  LL_SPI_FLAG_TXTF
  *            @arg @ref  LL_SPI_FLAG_UDR
  *            @arg @ref  LL_SPI_FLAG_CRCE
  *            @arg @ref  LL_SPI_FLAG_MODF
  *            @arg @ref  LL_SPI_FLAG_OVR
  *            @arg @ref  LL_SPI_FLAG_TIFRE
  *            @arg @ref  LL_SPI_FLAG_SUSP
  */
__STATIC_INLINE void LL_SPI_ClearFlag(SPI_TypeDef *p_spix, uint32_t mask)
{
  STM32_SET_BIT(p_spix->IFCR, (mask));
}

/**
  * @brief  Clear End Of Transfer flag.
  * @rmtoll
  *  IFCR         EOTC          LL_SPI_ClearFlag_EOT
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_EOT(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_EOTC);
}

/**
  * @brief  Clear TXTF flag.
  * @rmtoll
  *  IFCR         TXTFC         LL_SPI_ClearFlag_TXTF
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_TXTF(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_TXTFC);
}

/**
  * @brief  Clear Underrun error flag.
  * @rmtoll
  *  IFCR         UDRC          LL_SPI_ClearFlag_UDR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_UDR(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_UDRC);
}

/**
  * @brief  Clear Overrun error flag.
  * @rmtoll
  *  IFCR         OVRC          LL_SPI_ClearFlag_OVR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_OVR(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_OVRC);
}

/**
  * @brief  Clear CRC error flag.
  * @rmtoll
  *  IFCR         CRCEC        LL_SPI_ClearFlag_CRCERR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_CRCERR(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_CRCEC);
}

/**
  * @brief  Clear Mode fault error flag.
  * @rmtoll
  *  IFCR         MODFC         LL_SPI_ClearFlag_MODF
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_MODF(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_MODFC);
}

/**
  * @brief  Clear Frame format error flag.
  * @rmtoll
  *  IFCR         TIFREC        LL_SPI_ClearFlag_FRE
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_FRE(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_TIFREC);
}

/**
  * @brief  Clear SUSP flag.
  * @rmtoll
  *  IFCR         SUSPC         LL_SPI_ClearFlag_SUSP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_ClearFlag_SUSP(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IFCR, SPI_IFCR_SUSPC);
}

/**
  * @}
  */

/** @defgroup SPI_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable masked IT.
  * @rmtoll
  *  IER    SPI_IER_RXPIE    LL_SPI_EnableIT \n
  *  IER    SPI_IER_TXPIE    LL_SPI_EnableIT \n
  *  IER    SPI_IER_DXPIE    LL_SPI_EnableIT \n
  *  IER    SPI_IER_EOTIE    LL_SPI_EnableIT \n
  *  IER    SPI_IER_TXTFIE   LL_SPI_EnableIT \n
  *  IER    SPI_IER_UDRIE    LL_SPI_EnableIT \n
  *  IER    SPI_IER_CRCEIE   LL_SPI_EnableIT \n
  *  IER    SPI_IER_MODFIE   LL_SPI_EnableIT \n
  *  IER    SPI_IER_OVRIE    LL_SPI_EnableIT \n
  *  IER    SPI_IER_TIFREIE  LL_SPI_EnableIT
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to Enable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_SPI_IT_RXP
  *            @arg @ref  LL_SPI_IT_TXP
  *            @arg @ref  LL_SPI_IT_DXP
  *            @arg @ref  LL_SPI_IT_EOT
  *            @arg @ref  LL_SPI_IT_TXTF
  *            @arg @ref  LL_SPI_IT_UDR
  *            @arg @ref  LL_SPI_IT_CRCE
  *            @arg @ref  LL_SPI_IT_MODF
  *            @arg @ref  LL_SPI_IT_OVR
  *            @arg @ref  LL_SPI_IT_TIFRE
  */
__STATIC_INLINE void LL_SPI_EnableIT(SPI_TypeDef *p_spix, uint32_t mask)
{
  STM32_SET_BIT(p_spix->IER, (mask));
}

/**
  * @brief  Enable Rx Packet available IT.
  * @rmtoll
  *  IER          RXPIE         LL_SPI_EnableIT_RXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_RXP(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_RXPIE);
}

/**
  * @brief  Enable Tx Packet space available IT.
  * @rmtoll
  *  IER          TXPIE         LL_SPI_EnableIT_TXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_TXP(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_TXPIE);
}

/**
  * @brief  Enable Duplex Packet available IT.
  * @rmtoll
  *  IER          DXPIE         LL_SPI_EnableIT_DXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_DXP(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_DXPIE);
}

/**
  * @brief  Enable End Of Transfer IT.
  * @rmtoll
  *  IER          EOTIE         LL_SPI_EnableIT_EOT
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_EOT(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_EOTIE);
}

/**
  * @brief  Enable Transmit IT.
  * @rmtoll
  *  IER          TXTFIE        LL_SPI_EnableIT_TXTF
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_TXTF(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_TXTFIE);
}

/**
  * @brief  Enable Underrun IT.
  * @rmtoll
  *  IER          UDRIE         LL_SPI_EnableIT_UDR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_UDR(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_UDRIE);
}

/**
  * @brief  Enable Overrun IT.
  * @rmtoll
  *  IER          OVRIE         LL_SPI_EnableIT_OVR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_OVR(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_OVRIE);
}

/**
  * @brief  Enable CRC Error IT.
  * @rmtoll
  *  IER          CRCEIE        LL_SPI_EnableIT_CRCERR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_CRCERR(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_CRCEIE);
}

/**
  * @brief  Enable TI Frame Format Error IT.
  * @rmtoll
  *  IER          TIFREIE       LL_SPI_EnableIT_FRE
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_FRE(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_TIFREIE);
}

/**
  * @brief  Enable Mode Fault IT.
  * @rmtoll
  *  IER          MODFIE        LL_SPI_EnableIT_MODF
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableIT_MODF(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->IER, SPI_IER_MODFIE);
}


/**
  * @brief  Disable masked IT.
  * @rmtoll
  *  IER    SPI_IER_RXPIE    LL_SPI_DisableIT \n
  *  IER    SPI_IER_TXPIE    LL_SPI_DisableIT \n
  *  IER    SPI_IER_DXPIE    LL_SPI_DisableIT \n
  *  IER    SPI_IER_EOTIE    LL_SPI_DisableIT \n
  *  IER    SPI_IER_TXTFIE   LL_SPI_DisableIT \n
  *  IER    SPI_IER_UDRIE    LL_SPI_DisableIT \n
  *  IER    SPI_IER_CRCEIE   LL_SPI_DisableIT \n
  *  IER    SPI_IER_MODFIE   LL_SPI_DisableIT \n
  *  IER    SPI_IER_OVRIE    LL_SPI_DisableIT \n
  *  IER    SPI_IER_TIFREIE  LL_SPI_DisableIT
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to Disable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_SPI_IT_RXP
  *            @arg @ref  LL_SPI_IT_TXP
  *            @arg @ref  LL_SPI_IT_DXP
  *            @arg @ref  LL_SPI_IT_EOT
  *            @arg @ref  LL_SPI_IT_TXTF
  *            @arg @ref  LL_SPI_IT_UDR
  *            @arg @ref  LL_SPI_IT_CRCE
  *            @arg @ref  LL_SPI_IT_MODF
  *            @arg @ref  LL_SPI_IT_OVR
  *            @arg @ref  LL_SPI_IT_TIFRE
  */
__STATIC_INLINE void LL_SPI_DisableIT(SPI_TypeDef *p_spix, uint32_t mask)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_spix->IER, (mask));
}

/**
  * @brief  Disable Rx Packet available IT.
  * @rmtoll
  *  IER          RXPIE         LL_SPI_DisableIT_RXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_RXP(SPI_TypeDef *p_spix)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_spix->IER, SPI_IER_RXPIE);
}

/**
  * @brief  Disable Tx Packet space available IT.
  * @rmtoll
  *  IER          TXPIE         LL_SPI_DisableIT_TXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_TXP(SPI_TypeDef *p_spix)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_spix->IER, SPI_IER_TXPIE);
}

/**
  * @brief  Disable Duplex Packet available IT.
  * @rmtoll
  *  IER          DXPIE         LL_SPI_DisableIT_DXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_DXP(SPI_TypeDef *p_spix)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_spix->IER, SPI_IER_DXPIE);
}

/**
  * @brief  Disable End Of Transfer IT.
  * @rmtoll
  *  IER          EOTIE         LL_SPI_DisableIT_EOT
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_EOT(SPI_TypeDef *p_spix)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_spix->IER, SPI_IER_EOTIE);
}

/**
  * @brief  Disable TXTF IT.
  * @rmtoll
  *  IER          TXTFIE        LL_SPI_DisableIT_TXTF
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_TXTF(SPI_TypeDef *p_spix)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_spix->IER, SPI_IER_TXTFIE);
}

/**
  * @brief  Disable Underrun IT.
  * @rmtoll
  *  IER          UDRIE         LL_SPI_DisableIT_UDR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_UDR(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->IER, SPI_IER_UDRIE);
}

/**
  * @brief  Disable Overrun IT.
  * @rmtoll
  *  IER          OVRIE         LL_SPI_DisableIT_OVR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_OVR(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->IER, SPI_IER_OVRIE);
}

/**
  * @brief  Disable CRC Error IT.
  * @rmtoll
  *  IER          CRCEIE        LL_SPI_DisableIT_CRCERR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_CRCERR(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->IER, SPI_IER_CRCEIE);
}

/**
  * @brief  Disable TI Frame Format Error IT.
  * @rmtoll
  *  IER          TIFREIE       LL_SPI_DisableIT_FRE
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_FRE(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->IER, SPI_IER_TIFREIE);
}

/**
  * @brief  Disable MODF IT.
  * @rmtoll
  *  IER          MODFIE        LL_SPI_DisableIT_MODF
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableIT_MODF(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->IER, SPI_IER_MODFIE);
}


/**
  * @brief  Check if masked IT is Enabled.
  * @rmtoll
  *  IER    SPI_IER_RXPIE    LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_TXPIE    LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_DXPIE    LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_EOTIE    LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_TXTFIE   LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_UDRIE    LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_CRCEIE   LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_MODFIE   LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_OVRIE    LL_SPI_IsEnabledIT \n
  *  IER    SPI_IER_TIFREIE  LL_SPI_IsEnabledIT
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_SPI_IT_RXP
  *            @arg @ref  LL_SPI_IT_TXP
  *            @arg @ref  LL_SPI_IT_DXP
  *            @arg @ref  LL_SPI_IT_EOT
  *            @arg @ref  LL_SPI_IT_TXTF
  *            @arg @ref  LL_SPI_IT_UDR
  *            @arg @ref  LL_SPI_IT_CRCE
  *            @arg @ref  LL_SPI_IT_MODF
  *            @arg @ref  LL_SPI_IT_OVR
  *            @arg @ref  LL_SPI_IT_TIFRE
  * @retval State of masked bits (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT(const SPI_TypeDef *p_spix, uint32_t mask)
{
  return ((STM32_READ_BIT(p_spix->IER, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Check if Rx Packet available IT is enabled.
  * @rmtoll
  *  IER          RXPIE         LL_SPI_IsEnabledIT_RXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_RXP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_RXPIE) == (SPI_IER_RXPIE)) ? 1UL : 0UL);
}

