MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/**
  * @brief  Check if Tx Packet space available IT is enabled.
  * @rmtoll
  *  IER          TXPIE         LL_SPI_IsEnabledIT_TXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_TXP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_TXPIE) == (SPI_IER_TXPIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if Duplex Packet available IT is enabled.
  * @rmtoll
  *  IER          DXPIE         LL_SPI_IsEnabledIT_DXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_DXP(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_DXPIE) == (SPI_IER_DXPIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if End Of Transfer IT is enabled.
  * @rmtoll
  *  IER          EOTIE         LL_SPI_IsEnabledIT_EOT
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_EOT(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_EOTIE) == (SPI_IER_EOTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if TXTF IT is enabled.
  * @rmtoll
  *  IER          TXTFIE        LL_SPI_IsEnabledIT_TXTF
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_TXTF(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_TXTFIE) == (SPI_IER_TXTFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if Underrun IT is enabled.
  * @rmtoll
  *  IER          UDRIE         LL_SPI_IsEnabledIT_UDR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_UDR(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_UDRIE) == (SPI_IER_UDRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if Overrun IT is enabled.
  * @rmtoll
  *  IER          OVRIE         LL_SPI_IsEnabledIT_OVR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_OVR(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_OVRIE) == (SPI_IER_OVRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if CRC Error IT is enabled.
  * @rmtoll
  *  IER          CRCEIE        LL_SPI_IsEnabledIT_CRCERR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_CRCERR(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_CRCEIE) == (SPI_IER_CRCEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if TI Frame Format Error IT is enabled.
  * @rmtoll
  *  IER          TIFREIE       LL_SPI_IsEnabledIT_FRE
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_FRE(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_TIFREIE) == (SPI_IER_TIFREIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if MODF IT is enabled.
  * @rmtoll
  *  IER          MODFIE        LL_SPI_IsEnabledIT_MODF
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledIT_MODF(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->IER, SPI_IER_MODFIE) == (SPI_IER_MODFIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup SPI_LL_EF_DMA_Management DMA Management
  * @{
  */

/**
  * @brief  Enable DMA Rx.
  * @rmtoll
  *  CFG1         RXDMAEN       LL_SPI_EnableDMAReq_RX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableDMAReq_RX(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG1, SPI_CFG1_RXDMAEN);
}

/**
  * @brief  Disable DMA Rx.
  * @rmtoll
  *  CFG1         RXDMAEN       LL_SPI_DisableDMAReq_RX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableDMAReq_RX(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG1, SPI_CFG1_RXDMAEN);
}

/**
  * @brief  Check if DMA Rx is enabled.
  * @rmtoll
  *  CFG1         RXDMAEN       LL_SPI_IsEnabledDMAReq_RX
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledDMAReq_RX(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_RXDMAEN) == (SPI_CFG1_RXDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA Tx.
  * @rmtoll
  *  CFG1         TXDMAEN       LL_SPI_EnableDMAReq_TX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_EnableDMAReq_TX(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG1, SPI_CFG1_TXDMAEN);
}

/**
  * @brief  Disable DMA Tx.
  * @rmtoll
  *  CFG1         TXDMAEN       LL_SPI_DisableDMAReq_TX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_SPI_DisableDMAReq_TX(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG1, SPI_CFG1_TXDMAEN);
}

/**
  * @brief  Check if DMA Tx is enabled.
  * @rmtoll
  *  CFG1         TXDMAEN       LL_SPI_IsEnabledDMAReq_TX
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_SPI_IsEnabledDMAReq_TX(const SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CFG1, SPI_CFG1_TXDMAEN) == (SPI_CFG1_TXDMAEN)) ? 1UL : 0UL);
}
/**
  * @brief  Get the data register address used for DMA transfer.
  * @rmtoll
  *  TXDR           TXDR            LL_SPI_DMA_GetTxRegAddr
  * @param  p_spix SPI Instance
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_SPI_DMA_GetTxRegAddr(const SPI_TypeDef *p_spix)
{
  return (uint32_t) &(p_spix->TXDR);
}

/**
  * @brief  Get the data register address used for DMA transfer.
  * @rmtoll
  *  RXDR           RXDR            LL_SPI_DMA_GetRxRegAddr
  * @param  p_spix SPI Instance
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_SPI_DMA_GetRxRegAddr(const SPI_TypeDef *p_spix)
{
  return (uint32_t) &(p_spix->RXDR);
}
/**
  * @}
  */

/** @defgroup SPI_LL_EF_DATA_Management DATA_Management
  * @{
  */

/**
  * @brief  Read Data Register.
  * @rmtoll
  *  RXDR         .       LL_SPI_ReceiveData8
  * @param  p_spix SPI Instance
  * @retval 0..0xFF
  */
__STATIC_INLINE uint8_t LL_SPI_ReceiveData8(SPI_TypeDef *p_spix)
{
  return (*((__IM uint8_t *)&p_spix->RXDR));
}

/**
  * @brief  Read Data Register.
  * @rmtoll
  *  RXDR         .       LL_SPI_ReceiveData16
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFF
  */
__STATIC_INLINE uint16_t LL_SPI_ReceiveData16(SPI_TypeDef *p_spix)
{
#if defined (__GNUC__)
  __IM uint16_t *p_spirxdr = (__IM uint16_t *)(&(p_spix->RXDR));
  return (*p_spirxdr);
#else
  return (*((__IM uint16_t *)&p_spix->RXDR));
#endif /* __GNUC__ */
}

/**
  * @brief  Read Data Register.
  * @rmtoll
  *  RXDR         .       LL_SPI_ReceiveData32
  * @param  p_spix SPI Instance
  * @retval  0..0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_ReceiveData32(SPI_TypeDef *p_spix)
{
  return (*((__IM uint32_t *)&p_spix->RXDR));
}

/**
  * @brief  Write Data Register.
  * @rmtoll
  *  TXDR         .       LL_SPI_TransmitData8
  * @param  p_spix SPI Instance
  * @param  tx_data 0..0xFF
  */
__STATIC_INLINE void LL_SPI_TransmitData8(SPI_TypeDef *p_spix, uint8_t tx_data)
{
  *((__IO uint8_t *)&p_spix->TXDR) = tx_data;
}

/**
  * @brief  Write Data Register.
  * @rmtoll
  *  TXDR         .       LL_SPI_TransmitData16
  * @param  p_spix SPI Instance
  * @param  tx_data 0..0xFFFF
  */
__STATIC_INLINE void LL_SPI_TransmitData16(SPI_TypeDef *p_spix, uint16_t tx_data)
{
#if defined (__GNUC__)
  __IO uint16_t *p_spitxdr = ((__IO uint16_t *)&p_spix->TXDR);
  *p_spitxdr = tx_data;
#else
  *((__IO uint16_t *)&p_spix->TXDR) = tx_data;
#endif /* __GNUC__ */
}

/**
  * @brief  Write Data Register.
  * @rmtoll
  *  TXDR         .       LL_SPI_TransmitData32
  * @param  p_spix SPI Instance
  * @param  tx_data 0..0xFFFFFFFF
  */
__STATIC_INLINE void LL_SPI_TransmitData32(SPI_TypeDef *p_spix, uint32_t tx_data)
{
  *((__IO uint32_t *)&p_spix->TXDR) = tx_data;
}

/**
  * @brief  Set polynomial for CRC calculation.
  * @rmtoll
  *  CRCPOLY      CRCPOLY       LL_SPI_SetCRCPolynomial
  * @param  p_spix SPI Instance
  * @param  crc_poly 0..0xFFFFFFFF
  */
__STATIC_INLINE void LL_SPI_SetCRCPolynomial(SPI_TypeDef *p_spix, uint32_t crc_poly)
{
  STM32_WRITE_REG(p_spix->CRCPOLY, crc_poly);
}

/**
  * @brief  Get polynomial for CRC calculation.
  * @rmtoll
  *  CRCPOLY      CRCPOLY       LL_SPI_GetCRCPolynomial
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_GetCRCPolynomial(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_REG(p_spix->CRCPOLY));
}

/**
  * @brief  Set the underrun pattern.
  * @rmtoll
  *  UDRDR        UDRDR         LL_SPI_SetUDRPattern
  * @param  p_spix SPI Instance
  * @param  pattern 0..0xFFFFFFFF
  */
__STATIC_INLINE void LL_SPI_SetUDRPattern(SPI_TypeDef *p_spix, uint32_t pattern)
{
  STM32_WRITE_REG(p_spix->UDRDR, pattern);
}

/**
  * @brief  Get the underrun pattern.
  * @rmtoll
  *  UDRDR        UDRDR         LL_SPI_GetUDRPattern
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_GetUDRPattern(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_REG(p_spix->UDRDR));
}

/**
  * @brief  Get Rx CRC.
  * @rmtoll
  *  RXCRC       RXCRC         LL_SPI_GetRxCRC
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_GetRxCRC(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_REG(p_spix->RXCRC));
}

/**
  * @brief  Get Tx CRC.
  * @rmtoll
  *  TXCRC       TXCRC         LL_SPI_GetTxCRC
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_SPI_GetTxCRC(const SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_REG(p_spix->TXCRC));
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup I2S_LL I2S
  * @{
  */

/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup I2S_LL_Exported_Constants I2S exported constants
  * @{
  */

/** @defgroup I2S_LL_EC_MODE Operation Mode
  * @{
  */
#define LL_I2S_MODE_SLAVE_TX                   (0x00000000UL)                                 /*!< Slave transmit mode     */
#define LL_I2S_MODE_SLAVE_RX                   (SPI_I2SCFGR_I2SCFG_0)                         /*!< Slave receive mode      */
#define LL_I2S_MODE_MASTER_TX                  (SPI_I2SCFGR_I2SCFG_1)                         /*!< Master transmit mode    */
#define LL_I2S_MODE_MASTER_RX                  (SPI_I2SCFGR_I2SCFG_1 | SPI_I2SCFGR_I2SCFG_0)  /*!< Master receive mode     */
#define LL_I2S_MODE_SLAVE_FULL_DUPLEX          (SPI_I2SCFGR_I2SCFG_2)                         /*!< Slave full duplex mode  */
#define LL_I2S_MODE_MASTER_FULL_DUPLEX         (SPI_I2SCFGR_I2SCFG_2 | SPI_I2SCFGR_I2SCFG_0)  /*!< Master full duplex mode */
/**
  * @}
  */


/** @defgroup I2S_LL_EC_STANDARD I2S Standard
  * @{
  */
#define LL_I2S_STANDARD_PHILIPS                (0x00000000UL)                                                       /*!< PHILIPS standard                              */
#define LL_I2S_STANDARD_MSB                    (SPI_I2SCFGR_I2SSTD_0)                                               /*!< MSB-justified standard                        */
#define LL_I2S_STANDARD_LSB                    (SPI_I2SCFGR_I2SSTD_1)                                               /*!< LSB-justified standard                        */
#define LL_I2S_STANDARD_PCM_SHORT              (SPI_I2SCFGR_I2SSTD_0 | SPI_I2SCFGR_I2SSTD_1)                        /*!< PCM standard with short frame synchronization */
#define LL_I2S_STANDARD_PCM_LONG               (SPI_I2SCFGR_I2SSTD_0 | SPI_I2SCFGR_I2SSTD_1 | SPI_I2SCFGR_PCMSYNC)  /*!< PCM standard with long frame synchronization  */
/**
  * @}
  */

