MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/** @defgroup I2S_LL_EC_DATA_FORMAT Data Format
  * @{
  */
#define LL_I2S_DATA_FORMAT_16_BIT              (0x00000000UL)          /*!< 16-bit on 16-bit channel               */
#define LL_I2S_DATA_FORMAT_16_BIT_EXTENDED     (SPI_I2SCFGR_CHLEN)     /*!< 16-bit on 32-bit channel               */
#define LL_I2S_DATA_FORMAT_24_BIT              (SPI_I2SCFGR_DATLEN_0)  /*!< 24-bit on 32-bit channel right aligned */
#define LL_I2S_DATA_FORMAT_32_BIT              (SPI_I2SCFGR_DATLEN_1)  /*!< 32-bit on 32-bit channel               */
/**
  * @}
  */

/** @defgroup I2S_LL_EC_AUDIO_FREQ Audio Frequency
  * @{
  */

#define LL_I2S_MASTER_AUDIO_FREQ_192_KHZ       192000UL       /*!< Audio Frequency configuration 192000 Hz */
#define LL_I2S_MASTER_AUDIO_FREQ_96_KHZ        96000UL        /*!< Audio Frequency configuration 96000 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_48_KHZ        48000UL        /*!< Audio Frequency configuration 48000 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_44_KHZ        44100UL        /*!< Audio Frequency configuration 44100 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_32_KHZ        32000UL        /*!< Audio Frequency configuration 32000 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_22_KHZ        22050UL        /*!< Audio Frequency configuration 22050 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_16_KHZ        16000UL        /*!< Audio Frequency configuration 16000 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_11_KHZ        11025UL        /*!< Audio Frequency configuration 11025 Hz  */
#define LL_I2S_MASTER_AUDIO_FREQ_8_KHZ         8000UL         /*!< Audio Frequency configuration 8000 Hz   */
/**
  * @}
  */

/** @defgroup I2S_LL_EC_POLARITY Clock Polarity
  * @{
  */
#define LL_I2S_CLOCK_POLARITY_LOW              (0x00000000UL)       /*!< SCK signal is at 0 when idle */
#define LL_I2S_CLOCK_POLARITY_HIGH             (SPI_I2SCFGR_CKPOL)  /*!< SCK signal is at 1 when idle */
/**
  * @}
  */

/** @defgroup I2S_LL_EC_BIT_ORDER Transmission Bit Order
  * @{
  */
#define LL_I2S_MSB_FIRST                       (0x00000000UL)      /*!< MSB transmitted first */
#define LL_I2S_LSB_FIRST                       (SPI_CFG2_LSBFRST)  /*!< LSB transmitted first */
/**
  * @}
  */

/** @defgroup I2S_LL_EC_KEEP_IO_STATE Keep IO state
  * @{
  */
#define LL_I2S_MASTER_KEEP_IO_STATE_DISABLED   (0x00000000UL)     /*!< Master keep IO state disabled */
#define LL_I2S_MASTER_KEEP_IO_STATE_ENABLED    (SPI_CFG2_AFCNTR)  /*!< Master keep IO state enabled  */
/**
  * @}
  */

/** @defgroup I2S_LL_EC_PRESCALER_PARITY Prescaler Factor
  * @{
  */
#define LL_I2S_PRESCALER_PARITY_EVEN           (0x00000000UL)     /*!< Odd factor: Real divider value is =  I2SDIV * 2    */
#define LL_I2S_PRESCALER_PARITY_ODD            (SPI_I2SCFGR_ODD)  /*!< Odd factor: Real divider value is = (I2SDIV * 2)+1 */
/**
  * @}
  */

/**
  * @brief I2S_LL_EC_FIFO_THRESHOLD FIFO threshold level.
  */
#define LL_I2S_FIFO_THRESHOLD_1_DATA           (0x00000000UL)                                            /*!< 1-data */
#define LL_I2S_FIFO_THRESHOLD_2_DATA           (SPI_CFG1_FTHLV_0)                                        /*!< 2-data */
#define LL_I2S_FIFO_THRESHOLD_3_DATA           (SPI_CFG1_FTHLV_1)                                        /*!< 3-data */
#define LL_I2S_FIFO_THRESHOLD_4_DATA           (SPI_CFG1_FTHLV_0 | SPI_CFG1_FTHLV_1)                     /*!< 4-data */
#define LL_I2S_FIFO_THRESHOLD_5_DATA           (SPI_CFG1_FTHLV_2)                                        /*!< 5-data */
#define LL_I2S_FIFO_THRESHOLD_6_DATA           (SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_0)                     /*!< 6-data */
#define LL_I2S_FIFO_THRESHOLD_7_DATA           (SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1)                     /*!< 7-data */
#define LL_I2S_FIFO_THRESHOLD_8_DATA           (SPI_CFG1_FTHLV_2 | SPI_CFG1_FTHLV_1 | SPI_CFG1_FTHLV_0)  /*!< 8-data */
/**
  * @}
  */

/** @defgroup I2S_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_I2S_ReadReg and  LL_I2S_WriteReg functions.
  * @{
  */
#define LL_I2S_IT_RXP                          (SPI_IER_RXPIE)
#define LL_I2S_IT_TXP                          (SPI_IER_TXPIE)
#define LL_I2S_IT_DXP                          (SPI_IER_DXPIE)
#define LL_I2S_IT_UDR                          (SPI_IER_UDRIE)
#define LL_I2S_IT_OVR                          (SPI_IER_OVRIE)
#define LL_I2S_IT_TIFRE                        (SPI_IER_TIFREIE)
/**
  * @}
  */

/** @defgroup I2S_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_I2S_ReadReg function.
  * @{
  */
#define LL_I2S_FLAG_RXP                        (SPI_SR_RXP)
#define LL_I2S_FLAG_TXP                        (SPI_SR_TXP)
#define LL_I2S_FLAG_DXP                        (SPI_SR_DXP)
#define LL_I2S_FLAG_UDR                        (SPI_SR_UDR)
#define LL_I2S_FLAG_OVR                        (SPI_SR_OVR)
#define LL_I2S_FLAG_TIFRE                      (SPI_SR_TIFRE)
#define LL_I2S_FLAG_SUSP                       (SPI_SR_SUSP)
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup I2S_LL_Exported_Macros I2S Exported Macros
  * @{
  */

/** @defgroup I2S_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in I2S register.
  * @param  __INSTANCE__ I2S Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  */
#define LL_I2S_WRITE_REG(__INSTANCE__, __REG__, __VALUE__) STM32_WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in I2S register.
  * @param  __INSTANCE__ I2S Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_I2S_READ_REG(__INSTANCE__, __REG__) STM32_READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/

/** @defgroup I2S_LL_Exported_Functions I2S Exported Functions
  * @{
  */

/** @defgroup I2S_LL_EF_Configuration Configuration
  * @{
  */
/**
  * @brief  Configure the I2S Bus.
  * @rmtoll
  *  CFG2         LSBFRST       LL_I2S_ConfigBus \n
  *  I2SCFGR      I2SCFG        LL_I2S_ConfigBus \n
  *  I2SCFGR      I2SSTD        LL_I2S_ConfigBus \n
  *  I2SCFGR      PCMSYNC       LL_I2S_ConfigBus \n
  *  I2SCFGR      DATLEN        LL_I2S_ConfigBus \n
  *  I2SCFGR      CHLEN         LL_I2S_ConfigBus \n
  *  I2SCFGR      CKPOL         LL_I2S_ConfigBus
  * @param  p_spix SPI Instance
  * @param i2scfg_config This parameter must be a combination of the following groups:
  *         @arg @ref I2S_LL_EC_MODE
  *         @arg @ref I2S_LL_EC_STANDARD
  *         @arg @ref I2S_LL_EC_DATA_FORMAT
  *         @arg @ref I2S_LL_EC_POLARITY
  * @param cfg2_config: This parameter must be the configuration of the first bit @arg @ref I2S_LL_EC_BIT_ORDER
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_ConfigBus(SPI_TypeDef *p_spix, uint32_t i2scfgr_config, uint32_t cfg2_config)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, (SPI_I2SCFGR_I2SCFG | SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC | SPI_I2SCFGR_DATLEN
                                     | SPI_I2SCFGR_CHLEN | SPI_I2SCFGR_CKPOL), i2scfgr_config);
  STM32_MODIFY_REG(p_spix->CFG2, SPI_CFG2_LSBFRST, cfg2_config);
}

/**
  * @brief  Set I2S Data frame format.
  * @rmtoll
  *  I2SCFGR      DATLEN        LL_I2S_SetDataFormat \n
  *  I2SCFGR      CHLEN         LL_I2S_SetDataFormat
  * @param  p_spix SPI Handle
  * @param  data_format This parameter can be one of the following values:
  *         @arg @ref LL_I2S_DATA_FORMAT_16_BIT
  *         @arg @ref LL_I2S_DATA_FORMAT_16_BIT_EXTENDED
  *         @arg @ref LL_I2S_DATA_FORMAT_24_BIT
  *         @arg @ref LL_I2S_DATA_FORMAT_32_BIT
  */
__STATIC_INLINE void LL_I2S_SetDataFormat(SPI_TypeDef *p_spix, uint32_t data_format)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN, data_format);
}

/**
  * @brief  Get I2S Data frame format.
  * @rmtoll
  *  I2SCFGR      DATLEN        LL_I2S_GetDataFormat \n
  *  I2SCFGR      CHLEN         LL_I2S_GetDataFormat
  * @param  p_spix SPI Handle
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_I2S_DATA_FORMAT_16_BIT
  *         @arg @ref LL_I2S_DATA_FORMAT_16_BIT_EXTENDED
  *         @arg @ref LL_I2S_DATA_FORMAT_24_BIT
  *         @arg @ref LL_I2S_DATA_FORMAT_32_BIT
  */
__STATIC_INLINE uint32_t LL_I2S_GetDataFormat(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN));
}

/**
  * @brief  Set data alignment to left.
  * @rmtoll
  *  I2SCFGR      DATFMT         LL_I2S_SetDataAlignmentLeft
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_SetDataAlignmentLeft(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_DATFMT);
}

/**
  * @brief  Set data alignment to right.
  * @rmtoll
  *  I2SCFGR      DATFMT         LL_I2S_SetDataAlignmentRight
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_SetDataAlignmentRight(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_DATFMT);
}

/**
  * @brief  Get data alignment.
  * @rmtoll
  *  I2SCFGR      DATFMT         LL_I2S_GetDataAlignment
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE uint32_t LL_I2S_GetDataAlignment(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_DATFMT));
}

/**
  * @brief  Disable the channel length detection error.
  * @rmtoll
  *  I2SCFGR      FIXCH         LL_I2S_SLAVE_DisableLengthDetectionError
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_SLAVE_DisableLengthDetectionError(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_FIXCH);
}

/**
  * @brief  Enable the channel length detection error.
  * @rmtoll
  *  I2SCFGR      FIXCH         LL_I2S_SLAVE_EnableLengthDetectionError
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_SLAVE_EnableLengthDetectionError(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_FIXCH);
}

/**
  * @brief  Check if the channel length detection error is enabled.
  * @rmtoll
  *  I2SCFGR      FIXCH         LL_I2S_SLAVE_IsEnabledLengthDetectionError
  * @param  p_spix SPI Handle
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_SLAVE_IsEnabledLengthDetectionError(SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_FIXCH) == (SPI_I2SCFGR_FIXCH)) ? 1UL : 0UL);
}

/**
  * @brief  Invert the default polarity of WS signal.
  * @rmtoll
  *  I2SCFGR      WSINV         LL_I2S_EnableWordSelectInversion
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_EnableWordSelectInversion(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_WSINV);
}

/**
  * @brief  Use the default polarity of WS signal.
  * @rmtoll
  *  I2SCFGR      WSINV         LL_I2S_DisableWordSelectInversion
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_DisableWordSelectInversion(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_WSINV);
}

/**
  * @brief  Check if polarity of WS signal is inverted.
  * @rmtoll
  *  I2SCFGR      WSINV         LL_I2S_IsEnabledWordSelectInversion
  * @param  p_spix SPI Handle
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledWordSelectInversion(SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_WSINV) == (SPI_I2SCFGR_WSINV)) ? 1UL : 0UL);
}

/**
  * @brief  Set I2S Clock Polarity.
  * @rmtoll
  *  I2SCFGR      CKPOL         LL_I2S_SetClockPolarity
  * @param  p_spix SPI Handle
  * @param  clock_polarity This parameter can be one of the following values:
  *         @arg @ref LL_I2S_CLOCK_POLARITY_LOW
  *         @arg @ref LL_I2S_CLOCK_POLARITY_HIGH
  */
__STATIC_INLINE void LL_I2S_SetClockPolarity(SPI_TypeDef *p_spix, uint32_t clock_polarity)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, SPI_I2SCFGR_CKPOL, clock_polarity);
}

/**
  * @brief  Get I2S Clock Polarity.
  * @rmtoll
  *  I2SCFGR      CKPOL         LL_I2S_GetClockPolarity
  * @param  p_spix SPI Handle
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_I2S_CLOCK_POLARITY_LOW
  *         @arg @ref LL_I2S_CLOCK_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t LL_I2S_GetClockPolarity(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_CKPOL));
}

/**
  * @brief  Set I2S standard.
  * @rmtoll
  *  I2SCFGR      I2SSTD        LL_I2S_SetStandard \n
  *  I2SCFGR      PCMSYNC       LL_I2S_SetStandard
  * @param  p_spix SPI Handle
  * @param  standard This parameter can be one of the following values:
  *         @arg @ref LL_I2S_STANDARD_PHILIPS
  *         @arg @ref LL_I2S_STANDARD_MSB
  *         @arg @ref LL_I2S_STANDARD_LSB
  *         @arg @ref LL_I2S_STANDARD_PCM_SHORT
  *         @arg @ref LL_I2S_STANDARD_PCM_LONG
  */
__STATIC_INLINE void LL_I2S_SetStandard(SPI_TypeDef *p_spix, uint32_t standard)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC, standard);
}

/**
  * @brief  Get I2S standard.
  * @rmtoll
  *  I2SCFGR      I2SSTD        LL_I2S_GetStandard \n
  *  I2SCFGR      PCMSYNC       LL_I2S_GetStandard
  * @param  p_spix SPI Handle
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_I2S_STANDARD_PHILIPS
  *         @arg @ref LL_I2S_STANDARD_MSB
  *         @arg @ref LL_I2S_STANDARD_LSB
  *         @arg @ref LL_I2S_STANDARD_PCM_SHORT
  *         @arg @ref LL_I2S_STANDARD_PCM_LONG
  */
__STATIC_INLINE uint32_t LL_I2S_GetStandard(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_I2SSTD | SPI_I2SCFGR_PCMSYNC));
}

/**
  * @brief  Set I2S config.
  * @rmtoll
  *  I2SCFGR      I2SCFG        LL_I2S_SetTransferMode
  * @param  p_spix SPI Handle
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_I2S_MODE_SLAVE_TX
  *         @arg @ref LL_I2S_MODE_SLAVE_RX
  *         @arg @ref LL_I2S_MODE_SLAVE_FULL_DUPLEX
  *         @arg @ref LL_I2S_MODE_MASTER_TX
  *         @arg @ref LL_I2S_MODE_MASTER_RX
  *         @arg @ref LL_I2S_MODE_MASTER_FULL_DUPLEX
  */
__STATIC_INLINE void LL_I2S_SetTransferMode(SPI_TypeDef *p_spix, uint32_t mode)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, SPI_I2SCFGR_I2SCFG, mode);
}

/**
  * @brief  Get I2S config.
  * @rmtoll
  *  I2SCFGR      I2SCFG        LL_I2S_GetTransferMode
  * @param  p_spix SPI Handle
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_I2S_MODE_SLAVE_TX
  *         @arg @ref LL_I2S_MODE_SLAVE_RX
  *         @arg @ref LL_I2S_MODE_SLAVE_FULL_DUPLEX
  *         @arg @ref LL_I2S_MODE_MASTER_TX
  *         @arg @ref LL_I2S_MODE_MASTER_RX
  *         @arg @ref LL_I2S_MODE_MASTER_FULL_DUPLEX
  */
__STATIC_INLINE uint32_t LL_I2S_GetTransferMode(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_I2SCFG));
}

/**
  * @brief  Select I2S mode and Enable I2S peripheral.
  * @rmtoll
  *  CR1          SPE           LL_I2S_Enable
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_Enable(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_SPE);
}

/**
  * @brief  Disable I2S peripheral and disable I2S mode.
  * @rmtoll
  *  CR1          SPE           LL_I2S_Disable
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_Disable(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CR1, SPI_CR1_SPE);
}

/**
  * @brief  Check if I2S peripheral is enabled.
  * @rmtoll
  *  CR1          SPE           LL_I2S_IsEnabled
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabled(SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->CR1, SPI_CR1_SPE) == (SPI_CR1_SPE)) ? 1UL : 0UL);
}

/**
  * @brief  Select I2S mode.
  * @rmtoll
  *  I2SCFGR      I2SMOD        LL_I2S_EnableI2SMode
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_EnableI2SMode(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_I2SMOD);
}

/**
  * @brief  Disable I2S mode.
  * @rmtoll
  *  I2SCFGR      I2SMOD        LL_I2S_DisableI2SMode
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_DisableI2SMode(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_I2SMOD);
}

/**
  * @brief  Check if I2S mode is enabled.
  * @rmtoll
  *  I2SCFGR      I2SMOD        LL_I2S_IsEnabledI2SMode
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledI2SMode(SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_I2SMOD) == (SPI_I2SCFGR_I2SMOD)) ? 1UL : 0UL);
}

/**
  * @brief  Swap the SDO and SDI pin.
  * @rmtoll
  *  CFG2         IOSWP         LL_I2S_EnableIOSwap
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_EnableIOSwap(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableMosiMisoSwap(p_spix);
}

/**
  * @brief  Restore default function for SDO and SDI pin.
  * @rmtoll
  *  CFG2         IOSWP         LL_I2S_DisableMosiMisoSwap
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_DisableIOSwap(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableMosiMisoSwap(p_spix);
}

/**
  * @brief  Check if SDO and SDI pin are swapped.
  * @rmtoll
  *  CFG2         IOSWP         LL_I2S_IsEnabledMosiMisoSwap
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIOSwap(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledMosiMisoSwap(p_spix);
}

/**
  * @brief  Enable GPIO control.
  * @rmtoll
  *  CFG2         AFCNTR        LL_I2S_EnableGPIOControl
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_EnableGPIOControl(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableGPIOControl(p_spix);
}

/**
  * @brief  Disable GPIO control.
  * @rmtoll
  *  CFG2         AFCNTR        LL_I2S_DisableGPIOControl
  * @param  p_spix SPI Instance
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_DisableGPIOControl(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableGPIOControl(p_spix);
}

/**
  * @brief  Check if GPIO control is active.
  * @rmtoll
  *  CFG2         AFCNTR        LL_I2S_IsEnabledGPIOControl
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledGPIOControl(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledGPIOControl(p_spix);
}

/**
  * @brief  Lock the AF configuration of associated IOs.
  * @rmtoll
  *  CR1          IOLOCK        LL_I2S_EnableIOLock
  * @param  p_spix SPI Instance
  * @note   Once this bit is set, the SPI_CFG2 register content can not be modified until a hardware reset occurs.
  *         The reset of the IOLock bit is done by hardware. for that, LL_I2S_DisableIOLock can not exist.
  */
__STATIC_INLINE void LL_I2S_EnableIOLock(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIOLock(p_spix);
}

/**
  * @brief  Check if the the SPI_CFG2 register is locked.
  * @rmtoll
  *  CR1          IOLOCK        LL_I2S_IsEnabledIOLock
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIOLock(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIOLock(p_spix);
}

/**
  * @brief  Set Transfer Bit Order.
  * @rmtoll
  *  CFG2         LSBFRST       LL_I2S_SetTransferBitOrder
  * @param  p_spix SPI Instance
  * @param  bit_order This parameter can be one of the following values:
  *         @arg @ref LL_I2S_LSB_FIRST
  *         @arg @ref LL_I2S_MSB_FIRST
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_SetTransferBitOrder(SPI_TypeDef *p_spix, uint32_t bit_order)
{
  LL_SPI_SetTransferBitOrder(p_spix, bit_order);
}
/**
  * @brief  Get Transfer Bit Order.
  * @rmtoll
  *  CFG2         LSBFRST       LL_I2S_GetTransferBitOrder
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2S_LSB_FIRST
  *         @arg @ref LL_I2S_MSB_FIRST
  */
__STATIC_INLINE uint32_t LL_I2S_GetTransferBitOrder(SPI_TypeDef *p_spix)
{
  return LL_SPI_GetTransferBitOrder(p_spix);
}

/**
  * @brief  Start effective transfer on wire.
  * @rmtoll
  *  CR1          CSTART        LL_I2S_StartTransfer
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_StartTransfer(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CR1, SPI_CR1_CSTART);
}

/**
  * @brief  Check if there is an unfinished transfer.
  * @rmtoll
  *  CR1          CSTART        LL_I2S_IsTransferActive
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveTransfer(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveMasterTransfer(p_spix);
}

/**
  * @brief  Suspend an ongoing transfer for Master configuration.
  * @rmtoll
  *  CR1          CSUSP         LL_I2S_SuspendTransfer
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_SuspendTransfer(SPI_TypeDef *p_spix)
{
  LL_SPI_SuspendMasterTransfer(p_spix);
}

/**
  * @brief  Set threshold of FIFO that triggers a transfer event.
  * @rmtoll
  *  CFG1         FTHLV         LL_I2S_SetFIFOThreshold
  * @param  p_spix SPI Instance
  * @param  threshold This parameter can be one of the following values:
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_1_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_2_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_3_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_4_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_5_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_6_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_7_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_8_DATA
  * @note   This configuration can not be changed when I2S is enabled.
  */
__STATIC_INLINE void LL_I2S_SetFIFOThreshold(SPI_TypeDef *p_spix, uint32_t threshold)
{
  LL_SPI_SetFIFOThreshold(p_spix, threshold);
}

/**
  * @brief  Get threshold of FIFO that triggers a transfer event.
  * @rmtoll
  *  CFG1         FTHLV         LL_I2S_GetFIFOThreshold
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_1_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_2_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_3_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_4_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_5_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_6_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_7_DATA
  *         @arg @ref LL_I2S_FIFO_THRESHOLD_8_DATA
  */
__STATIC_INLINE uint32_t LL_I2S_GetFIFOThreshold(SPI_TypeDef *p_spix)
{
  return LL_SPI_GetFIFOThreshold(p_spix);
}

/**
  * @brief  Set I2S linear prescaler.
  * @rmtoll
  *  I2SCFGR        I2SDIV        LL_I2S_SetPrescalerLinear
  * @param  p_spix SPI Instance
  * @param  prescaler_linear Value between Min_Data=0x00 and Max_Data=0xFF
  * @note   prescaler_linear '1' is not authorized with parity LL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE void LL_I2S_SetPrescalerLinear(SPI_TypeDef *p_spix, uint32_t prescaler_linear)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, SPI_I2SCFGR_I2SDIV, (prescaler_linear << SPI_I2SCFGR_I2SDIV_Pos));
}

/**
  * @brief  Get I2S linear prescaler.
  * @rmtoll
  *  I2SCFGR        I2SDIV        LL_I2S_GetPrescalerLinear
  * @param  p_spix SPI Instance
  * @retval prescaler_linear Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_I2S_GetPrescalerLinear(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_I2SDIV) >> SPI_I2SCFGR_I2SDIV_Pos);
}

