MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/**
  * @brief  Set I2S parity prescaler.
  * @rmtoll
  *  I2SCFGR        ODD           LL_I2S_SetPrescalerParity
  * @param  p_spix SPI Instance
  * @param  prescaler_parity This parameter can be one of the following values:
  *         @arg @ref LL_I2S_PRESCALER_PARITY_EVEN
  *         @arg @ref LL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE void LL_I2S_SetPrescalerParity(SPI_TypeDef *p_spix, uint32_t prescaler_parity)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, SPI_I2SCFGR_ODD, prescaler_parity << SPI_I2SCFGR_ODD_Pos);
}

/**
  * @brief  Get I2S parity prescaler.
  * @rmtoll
  *  I2SCFGR        ODD           LL_I2S_GetPrescalerParity
  * @param  p_spix SPI Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2S_PRESCALER_PARITY_EVEN
  *         @arg @ref LL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE uint32_t LL_I2S_GetPrescalerParity(SPI_TypeDef *p_spix)
{
  return (uint32_t)(STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_ODD) >> SPI_I2SCFGR_ODD_Pos);
}

/**
  * @brief  Set I2S prescaler.
  * @rmtoll
  *  I2SCFGR        ODD           LL_I2S_SetPrescaler \n
  *  I2SCFGR        I2S_DIV       LL_I2S_SetPrescaler
  * @param  p_spix SPI Instance
  * @param  i2s_div Value between Min_Data=0x00 and Max_Data=0xFF
  * @param  prescaler_parity This parameter can be one of the following values:
  *         @arg @ref LL_I2S_PRESCALER_PARITY_EVEN
  *         @arg @ref LL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE void LL_I2S_SetPrescaler(SPI_TypeDef *p_spix, uint32_t i2s_div, uint32_t i2s_odd)
{
  STM32_MODIFY_REG(p_spix->I2SCFGR, (SPI_I2SCFGR_I2SDIV | SPI_I2SCFGR_ODD),
                   ((i2s_div << SPI_I2SCFGR_I2SDIV_Pos) | (i2s_odd << SPI_I2SCFGR_ODD_Pos)));
}

/**
  * @brief  Enable the Master Clock Output (Pin MCK).
  * @rmtoll
  *  I2SCFGR      MCKOE         LL_I2S_EnableMasterClock
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_EnableMasterClock(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_MCKOE);
}

/**
  * @brief  Disable the Master Clock Output (Pin MCK).
  * @rmtoll
  *  I2SCFGR      MCKOE         LL_I2S_DisableMasterClock
  * @param  p_spix SPI Handle
  */
__STATIC_INLINE void LL_I2S_DisableMasterClock(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_MCKOE);
}

/**
  * @brief  Check if the master clock output (Pin MCK) is enabled.
  * @rmtoll
  *  I2SCFGR        MCKOE         LL_I2S_IsEnabledMasterClock
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledMasterClock(SPI_TypeDef *p_spix)
{
  return ((STM32_READ_BIT(p_spix->I2SCFGR, SPI_I2SCFGR_MCKOE) == (SPI_I2SCFGR_MCKOE)) ? 1UL : 0UL);
}
/**
  * @}
  */


/** @defgroup I2S_LL_EF_FLAG_Management FLAG_Management
  * @{
  */
/**
  * @brief  Indicate the status of a mask of flags.
  * @rmtoll
  *  SR    SPI_SR_RXP        LL_I2S_IsActiveFlag \n
  *  SR    SPI_SR_TXP        LL_I2S_IsActiveFlag \n
  *  SR    SPI_SR_UDR        LL_I2S_IsActiveFlag \n
  *  SR    SPI_SR_OVR        LL_I2S_IsActiveFlag \n
  *  SR    SPI_SR_TIFRE      LL_I2S_IsActiveFlag \n
  *  SR    SPI_SR_SUSP       LL_I2S_IsActiveFlag
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_I2S_FLAG_RXP
  *            @arg @ref  LL_I2S_FLAG_TXP
  *            @arg @ref  LL_I2S_FLAG_UDR
  *            @arg @ref  LL_I2S_FLAG_OVR
  *            @arg @ref  LL_I2S_FLAG_TIFRE
  *            @arg @ref  LL_I2S_FLAG_SUSP
  * @retval State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag(const SPI_TypeDef *p_spix, uint32_t mask)
{
  return LL_SPI_IsActiveFlag(p_spix, mask);
}

/**
  * @brief  Check if there enough data in FIFO to read a full packet.
  * @rmtoll
  *  SR           RXP           LL_I2S_IsActiveFlag_RXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag_RXP(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveFlag_RXP(p_spix);
}

/**
  * @brief  Check if there enough space in FIFO to hold a full packet.
  * @rmtoll
  *  SR           TXP           LL_I2S_IsActiveFlag_TXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag_TXP(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveFlag_TXP(p_spix);
}

/**
  * @brief  Get Underrun error flag.
  * @rmtoll
  *  SR           UDR           LL_I2S_IsActiveFlag_UDR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag_UDR(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveFlag_UDR(p_spix);
}

/**
  * @brief  Get Overrun error flag.
  * @rmtoll
  *  SR           OVR           LL_I2S_IsActiveFlag_OVR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag_OVR(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveFlag_OVR(p_spix);
}

/**
  * @brief  Get TI Frame format error flag.
  * @rmtoll
  *  SR           TIFRE         LL_I2S_IsActiveFlag_FRE
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag_FRE(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveFlag_FRE(p_spix);
}

/**
  * @brief  Check if a suspend operation is done.
  * @rmtoll
  *  SR           SUSP          LL_I2S_IsActiveFlag_SUSP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsActiveFlag_SUSP(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsActiveFlag_SUSP(p_spix);
}

/**
  * @brief  Clear the status of a mask of flags.
  * @rmtoll
  *  IFCR    UDR    LL_I2S_ClearFlag \n
  *  IFCR    OVR    LL_I2S_ClearFlag \n
  *  IFCR    TIFRE  LL_I2S_ClearFlag \n
  *  IFCR    SUSP   LL_I2S_ClearFlag
  * @param  p_spix SPI Instance.
  * @param  mask Flags to clear.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_I2S_FLAG_UDR
  *            @arg @ref  LL_I2S_FLAG_OVR
  *            @arg @ref  LL_I2S_FLAG_TIFRE
  *            @arg @ref  LL_I2S_FLAG_SUSP
  */
__STATIC_INLINE void LL_I2S_ClearFlag(SPI_TypeDef *p_spix, uint32_t mask)
{
  LL_SPI_ClearFlag(p_spix, mask);
}

/**
  * @brief  Clear Underrun error flag.
  * @rmtoll
  *  IFCR         UDRC          LL_I2S_ClearFlag_UDR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_ClearFlag_UDR(SPI_TypeDef *p_spix)
{
  LL_SPI_ClearFlag_UDR(p_spix);
}

/**
  * @brief  Clear Overrun error flag.
  * @rmtoll
  *  IFCR         OVRC          LL_I2S_ClearFlag_OVR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_ClearFlag_OVR(SPI_TypeDef *p_spix)
{
  LL_SPI_ClearFlag_OVR(p_spix);
}

/**
  * @brief  Clear Frame format error flag.
  * @rmtoll
  *  IFCR         TIFREC        LL_I2S_ClearFlag_FRE
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_ClearFlag_FRE(SPI_TypeDef *p_spix)
{
  LL_SPI_ClearFlag_FRE(p_spix);
}

/**
  * @brief  Clear SUSP flag.
  * @rmtoll
  *  IFCR         SUSPC         LL_I2S_ClearFlag_SUSP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_ClearFlag_SUSP(SPI_TypeDef *p_spix)
{
  LL_SPI_ClearFlag_SUSP(p_spix);
}

/**
  * @}
  */

