MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/** @defgroup I2S_LL_EF_IT_Management IT_Management
  * @{
  */
/**
  * @brief  Enable masked IT.
  * @rmtoll
  *  IER    SPI_IER_RXPIE    LL_I2S_EnableIT \n
  *  IER    SPI_IER_TXPIE    LL_I2S_EnableIT \n
  *  IER    SPI_IER_DXPIE    LL_I2S_EnableIT \n
  *  IER    SPI_IER_UDRIE    LL_I2S_EnableIT \n
  *  IER    SPI_IER_OVRIE    LL_I2S_EnableIT \n
  *  IER    SPI_IER_TIFREIE  LL_I2S_EnableIT
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to Enable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_I2S_IT_RXP
  *            @arg @ref  LL_I2S_IT_TXP
  *            @arg @ref  LL_I2S_IT_DXP
  *            @arg @ref  LL_I2S_IT_UDR
  *            @arg @ref  LL_I2S_IT_OVR
  *            @arg @ref  LL_I2S_IT_TIFRE
  */
__STATIC_INLINE void LL_I2S_EnableIT(SPI_TypeDef *p_spix, uint32_t mask)
{
  STM32_SET_BIT(p_spix->IER, (mask));
}

/**
  * @brief  Enable Rx Packet available IT.
  * @rmtoll
  *  IER          RXPIE         LL_I2S_EnableIT_RXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableIT_RXP(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIT_RXP(p_spix);
}

/**
  * @brief  Enable Tx Packet space available IT.
  * @rmtoll
  *  IER          TXPIE         LL_I2S_EnableIT_TXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableIT_TXP(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIT_TXP(p_spix);
}

/**
  * @brief  Enable Duplex Packet available IT.
  * @rmtoll
  *  IER          DXPIE         LL_I2S_EnableIT_DXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableIT_DXP(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIT_DXP(p_spix);
}

/**
  * @brief  Enable Underrun IT.
  * @rmtoll
  *  IER          UDRIE         LL_I2S_EnableIT_UDR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableIT_UDR(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIT_UDR(p_spix);
}

/**
  * @brief  Enable Overrun IT.
  * @rmtoll
  *  IER          OVRIE         LL_I2S_EnableIT_OVR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableIT_OVR(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIT_OVR(p_spix);
}

/**
  * @brief  Enable TI Frame Format Error IT.
  * @rmtoll
  *  IER          TIFREIE       LL_I2S_EnableIT_FRE
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableIT_FRE(SPI_TypeDef *p_spix)
{
  LL_SPI_EnableIT_FRE(p_spix);
}

/**
  * @brief  Disable masked IT.
  * @rmtoll
  *  IER    SPI_IER_RXPIE    LL_I2S_DisableIT \n
  *  IER    SPI_IER_TXPIE    LL_I2S_DisableIT \n
  *  IER    SPI_IER_DXPIE    LL_I2S_DisableIT \n
  *  IER    SPI_IER_UDRIE    LL_I2S_DisableIT \n
  *  IER    SPI_IER_OVRIE    LL_I2S_DisableIT \n
  *  IER    SPI_IER_TIFREIE  LL_I2S_DisableIT
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to Disable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_I2S_IT_RXP
  *            @arg @ref  LL_I2S_IT_TXP
  *            @arg @ref  LL_I2S_IT_DXP
  *            @arg @ref  LL_I2S_IT_UDR
  *            @arg @ref  LL_I2S_IT_OVR
  *            @arg @ref  LL_I2S_IT_TIFRE
  */
__STATIC_INLINE void LL_I2S_DisableIT(SPI_TypeDef *p_spix, uint32_t mask)
{
  LL_SPI_DisableIT(p_spix, (mask));
}

/**
  * @brief  Disable Rx Packet available IT.
  * @rmtoll
  *  IER          RXPIE         LL_I2S_DisableIT_RXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableIT_RXP(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableIT_RXP(p_spix);
}

/**
  * @brief  Disable Tx Packet space available IT.
  * @rmtoll
  *  IER          TXPIE         LL_I2S_DisableIT_TXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableIT_TXP(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableIT_TXP(p_spix);
}

/**
  * @brief  Disable Duplex Packet available IT.
  * @rmtoll
  *  IER          DXPIE         LL_I2S_DisableIT_DXP
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableIT_DXP(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableIT_DXP(p_spix);
}

/**
  * @brief  Disable Underrun IT.
  * @rmtoll
  *  IER          UDRIE         LL_I2S_DisableIT_UDR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableIT_UDR(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableIT_UDR(p_spix);
}

/**
  * @brief  Disable Overrun IT.
  * @rmtoll
  *  IER          OVRIE         LL_I2S_DisableIT_OVR
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableIT_OVR(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableIT_OVR(p_spix);
}

/**
  * @brief  Disable TI Frame Format Error IT.
  * @rmtoll
  *  IER          TIFREIE       LL_I2S_DisableIT_FRE
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableIT_FRE(SPI_TypeDef *p_spix)
{
  LL_SPI_DisableIT_FRE(p_spix);
}

/**
  * @brief  Check if masked IT is Enabled.
  * @rmtoll
  *  IER    SPI_IER_RXPIE    LL_I2S_IsEnabledIT \n
  *  IER    SPI_IER_TXPIE    LL_I2S_IsEnabledIT \n
  *  IER    SPI_IER_DXPIE    LL_I2S_IsEnabledIT \n
  *  IER    SPI_IER_UDRIE    LL_I2S_IsEnabledIT \n
  *  IER    SPI_IER_OVRIE    LL_I2S_IsEnabledIT \n
  *  IER    SPI_IER_TIFREIE  LL_I2S_IsEnabledIT
  * @param  p_spix SPI Instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_I2S_IT_RXP
  *            @arg @ref  LL_I2S_IT_TXP
  *            @arg @ref  LL_I2S_IT_DXP
  *            @arg @ref  LL_I2S_IT_UDR
  *            @arg @ref  LL_I2S_IT_OVR
  *            @arg @ref  LL_I2S_IT_TIFRE
  * @retval State of masked bits (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT(const SPI_TypeDef *p_spix, uint32_t mask)
{
  return LL_SPI_IsEnabledIT(p_spix, mask);
}

/**
  * @brief  Check if Rx Packet available IT is enabled.
  * @rmtoll
  *  IER          RXPIE         LL_I2S_IsEnabledIT_RXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT_RXP(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIT_RXP(p_spix);
}

/**
  * @brief  Check if Tx Packet space available IT is enabled.
  * @rmtoll
  *  IER          TXPIE         LL_I2S_IsEnabledIT_TXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT_TXP(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIT_TXP(p_spix);
}

/**
  * @brief  Check if Duplex Packet available IT is enabled.
  * @rmtoll
  *  IER          DXPIE         LL_I2S_IsEnabledIT_DXP
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT_DXP(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIT_DXP(p_spix);
}

/**
  * @brief  Check if Underrun IT is enabled.
  * @rmtoll
  *  IER          UDRIE         LL_I2S_IsEnabledIT_UDR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT_UDR(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIT_UDR(p_spix);
}

/**
  * @brief  Check if Overrun IT is enabled.
  * @rmtoll
  *  IER          OVRIE         LL_I2S_IsEnabledIT_OVR
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT_OVR(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIT_OVR(p_spix);
}

/**
  * @brief  Check if TI Frame Format Error IT is enabled.
  * @rmtoll
  *  IER          TIFREIE       LL_I2S_IsEnabledIT_FRE
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledIT_FRE(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledIT_FRE(p_spix);
}

/**
  * @}
  */

