MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_spi.h
/** @defgroup I2S_LL_EF_DMA_Management DMA_Management
  * @{
  */

/**
  * @brief  Enable DMA Rx.
  * @rmtoll
  *  CFG1         RXDMAEN       LL_I2S_EnableDMAReq_RX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableDMAReq_RX(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG1, SPI_CFG1_RXDMAEN);
}

/**
  * @brief  Disable DMA Rx.
  * @rmtoll
  *  CFG1         RXDMAEN       LL_I2S_DisableDMAReq_RX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableDMAReq_RX(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG1, SPI_CFG1_RXDMAEN);
}

/**
  * @brief  Check if DMA Rx is enabled.
  * @rmtoll
  *  CFG1         RXDMAEN       LL_I2S_IsEnabledDMAReq_RX
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledDMAReq_RX(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledDMAReq_RX(p_spix);
}

/**
  * @brief  Enable DMA Tx.
  * @rmtoll
  *  CFG1         TXDMAEN       LL_I2S_EnableDMAReq_TX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_EnableDMAReq_TX(SPI_TypeDef *p_spix)
{
  STM32_SET_BIT(p_spix->CFG1, SPI_CFG1_TXDMAEN);
}

/**
  * @brief  Disable DMA Tx.
  * @rmtoll
  *  CFG1         TXDMAEN       LL_I2S_DisableDMAReq_TX
  * @param  p_spix SPI Instance
  */
__STATIC_INLINE void LL_I2S_DisableDMAReq_TX(SPI_TypeDef *p_spix)
{
  STM32_CLEAR_BIT(p_spix->CFG1, SPI_CFG1_TXDMAEN);
}

/**
  * @brief  Check if DMA Tx is enabled.
  * @rmtoll
  *  CFG1         TXDMAEN       LL_I2S_IsEnabledDMAReq_TX
  * @param  p_spix SPI Instance
  * @retval State of bit (1 or 0)
  */
__STATIC_INLINE uint32_t LL_I2S_IsEnabledDMAReq_TX(SPI_TypeDef *p_spix)
{
  return LL_SPI_IsEnabledDMAReq_TX(p_spix);
}

/**
  * @}
  */

/** @defgroup I2S_LL_EF_DATA_Management DATA_Management
  * @{
  */

/**
  * @brief  Read Data Register.
  * @rmtoll
  *  RXDR         .       LL_I2S_ReceiveData16
  * @param  p_spix SPI Instance
  * @retval 0..0xFFFF
  */
__STATIC_INLINE uint16_t LL_I2S_ReceiveData16(SPI_TypeDef *p_spix)
{
#if defined(__GNUC__)
  __IM uint16_t *prxdr_16bits = (__IM uint16_t *)(&(p_spix->RXDR));
  return (*prxdr_16bits);
#else
  return (*((__IM uint16_t *)&p_spix->RXDR));
#endif /* __GNUC__ */
}

/**
  * @brief  Read Data Register.
  * @rmtoll
  *  RXDR         .       LL_I2S_ReceiveData32
  * @param  p_spix SPI Instance
  * @retval  0..0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_I2S_ReceiveData32(SPI_TypeDef *p_spix)
{
  return (*((__IM uint32_t *)&p_spix->RXDR));
}

/**
  * @brief  Write Data Register.
  * @rmtoll
  *  TXDR         .       LL_I2S_TransmitData16
  * @param  p_spix SPI Instance
  * @param  tx_data 0..0xFFFF
  */
__STATIC_INLINE void LL_I2S_TransmitData16(SPI_TypeDef *p_spix, uint16_t tx_data)
{
#if defined (__GNUC__)
  __IO uint16_t *ptxdr_16bits = (__IO uint16_t *)(&(p_spix->TXDR));

  *ptxdr_16bits = tx_data;
#else
  *((__IO uint16_t *)&p_spix->TXDR) = tx_data;
#endif /* __GNUC__ */
}

/**
  * @brief  Write Data Register.
  * @rmtoll
  *  TXDR         .       LL_I2S_TransmitData32
  * @param  p_spix SPI Instance
  * @param  tx_data 0..0xFFFFFFFF
  */
__STATIC_INLINE void LL_I2S_TransmitData32(SPI_TypeDef *p_spix, uint32_t tx_data)
{
  *((__IO uint32_t *)&p_spix->TXDR) = tx_data;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(SPI1) || defined(SPI2) || defined(SPI3) */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_SPI_H */
